{
  "currentSigned": "ACTUELLEMENT CONNECTÉ EN TANT QUE",
  "emailLabel": "Votre email actuel",
  "form.schoolName.placeholder": "Entrez le nom officiel et complet de votre école",
  "form.schoolName.title": "Le nom de votre école",
  "form.schoolRole.option.administrator": "Administrateur scolaire",
  "form.schoolRole.option.student": "Étudiant",
  "form.schoolRole.option.teacher": "Professeur",
  "form.schoolRole.title": "Votre rôle à l'école",
  "form.terms.desc.and": "et",
  "form.terms.desc.end": ". En soumettant :",
  "form.terms.desc.front": "Vos informations et votre utilisation du statut Éducation Vérifiée sont soumises à notre",
  "form.terms.desc.privacyPolicy": "Politique de confidentialité",
  "form.terms.desc.termsOfService": "Conditions d'utilisation",
  "form.terms.option.age": "Je confirme que j'ai au moins 18 ans.",
  "form.terms.option.inSchool": "Je confirme que je suis inscrit ou employé dans l'institution indiquée. Dify peut demander une preuve d'inscription/employé. Si je falsifie mon éligibilité, j'accepte de payer tous les frais initialement annulés en fonction de mon statut éducatif.",
  "form.terms.title": "Conditions et accords",
  "learn": "Apprenez comment faire vérifier votre éducation",
  "notice.action.dismiss": "Rejeter",
  "notice.action.reVerify": "Re-vérifier",
  "notice.action.upgrade": "Améliorer",
  "notice.alreadyGraduated.expired": "N'hésitez pas à vous abonner à tout moment pour accéder à toutes les fonctionnalités payantes.",
  "notice.alreadyGraduated.isAboutToExpire": "Votre abonnement actuel restera actif. Lorsqu'il se terminera, vous serez transféré au plan Sandbox, ou vous pourrez mettre à niveau à tout moment pour restaurer l'accès complet aux fonctionnalités payantes.",
  "notice.alreadyGraduated.title": "Déjà diplômé ?",
  "notice.dateFormat": "JJ/MM/YYYY",
  "notice.expired.summary.line1": "Vous pouvez toujours accéder à Dify et l'utiliser.",
  "notice.expired.summary.line2": "Cependant, vous n'êtes plus éligible pour de nouveaux bons de réduction pour l'éducation.",
  "notice.expired.title": "Votre statut éducatif a expiré",
  "notice.isAboutToExpire.summary": "Ne vous inquiétez pas — cela n'affectera pas votre abonnement actuel, mais vous n'obtiendrez pas la remise éducative lors de son renouvellement à moins que vous ne vérifiiez à nouveau votre statut.",
  "notice.isAboutToExpire.title": "Votre statut éducatif expirera le {{date}}",
  "notice.stillInEducation.expired": "Veuillez vérifier à nouveau maintenant pour obtenir un nouveau coupon pour la prochaine année académique. Nous l'ajouterons à votre compte et vous pourrez l'utiliser pour la prochaine mise à niveau.",
  "notice.stillInEducation.isAboutToExpire": "Vérifiez de nouveau maintenant pour obtenir un nouveau coupon pour la prochaine année académique. Il sera enregistré dans votre compte et prêt à être utilisé lors de votre prochain renouvellement.",
  "notice.stillInEducation.title": "Encore dans l'éducation ?",
  "rejectContent": "Malheureusement, vous n'êtes pas éligible au statut Éducation Vérifié et ne pouvez donc pas recevoir le coupon exclusif de 100 % pour le Plan Professionnel Dify si vous utilisez cette adresse e-mail.",
  "rejectTitle": "Votre vérification éducative Dify a été rejetée.",
  "submit": "Soumettre",
  "submitError": "L'envoi du formulaire a échoué. Veuillez réessayer plus tard.",
  "successContent": "Nous avons émis un coupon de réduction de 100 % pour le plan Dify Professionnel sur votre compte. Le coupon est valable pendant un an, veuillez l'utiliser dans la période de validité.",
  "successTitle": "Vous avez obtenu une éducation Dify vérifiée.",
  "toVerified": "Faire vérifier l'éducation",
  "toVerifiedTip.coupon": "coupon exclusif 100%",
  "toVerifiedTip.end": "pour le Plan Professionnel Dify.",
  "toVerifiedTip.front": "Vous êtes maintenant éligible pour le statut Vérifié en Éducation. Veuillez entrer vos informations éducatives ci-dessous pour compléter le processus et recevoir un"
}
