{
  "currentSigned": "ATTUALMENTE ACCEDUTO COME",
  "emailLabel": "La tua email attuale",
  "form.schoolName.placeholder": "Inserisci il nome ufficiale e completo della tua scuola",
  "form.schoolName.title": "Il Nome della tua Scuola",
  "form.schoolRole.option.administrator": "Amministratore scolastico",
  "form.schoolRole.option.student": "Studente",
  "form.schoolRole.option.teacher": "Insegnante",
  "form.schoolRole.title": "Il tuo ruolo scolastico",
  "form.terms.desc.and": "e",
  "form.terms.desc.end": ". Inviando:",
  "form.terms.desc.front": "Le tue informazioni e l'uso dello stato di Educazione Verificato sono soggetti a nostri",
  "form.terms.desc.privacyPolicy": "Informativa sulla privacy",
  "form.terms.desc.termsOfService": "Termini di servizio",
  "form.terms.option.age": "Confermo di avere almeno 18 anni",
  "form.terms.option.inSchool": "Confermo di essere iscritto o impiegato presso l'istituzione fornita. Dify può richiedere una prova di iscrizione/impegno. Se rappresento erroneamente la mia idoneità, accetto di pagare eventuali tasse inizialmente esonerate in base al mio stato di istruzione.",
  "form.terms.title": "Termini e Accordi",
  "learn": "Scopri come far verificare la tua istruzione",
  "notice.action.dismiss": "Ignora",
  "notice.action.reVerify": "Riconferma",
  "notice.action.upgrade": "Aggiornare",
  "notice.alreadyGraduated.expired": "Sentiti libero di effettuare l'upgrade in qualsiasi momento per avere accesso completo alle funzionalità a pagamento.",
  "notice.alreadyGraduated.isAboutToExpire": "Il tuo abbonamento attuale rimarrà attivo. Quando scade, verrai spostato nel piano Sandbox, oppure puoi eseguire l'upgrade in qualsiasi momento per ripristinare l'accesso completo alle funzionalità a pagamento.",
  "notice.alreadyGraduated.title": "Già laureato?",
  "notice.dateFormat": "GG/MM/AAAA",
  "notice.expired.summary.line1": "Puoi ancora accedere e usare Dify.",
  "notice.expired.summary.line2": "Tuttavia, non sei più idoneo per i nuovi coupon di sconto per l'istruzione.",
  "notice.expired.title": "Il tuo stato di istruzione è scaduto",
  "notice.isAboutToExpire.summary": "Non preoccuparti — ciò non influenzerà il tuo abbonamento attuale, ma non otterrai lo sconto per l'istruzione al momento del rinnovo a meno che tu non verifichi nuovamente il tuo stato.",
  "notice.isAboutToExpire.title": "Il tuo stato educativo scadrà il {{date}}",
  "notice.stillInEducation.expired": "Verifica di nuovo ora per ottenere un nuovo coupon per il prossimo anno accademico. Lo aggiungeremo al tuo account e potrai usarlo per il prossimo aggiornamento.",
  "notice.stillInEducation.isAboutToExpire": "Verifica di nuovo ora per ottenere un nuovo coupon per il prossimo anno accademico. Sarà salvato nel tuo account e pronto per essere utilizzato al tuo prossimo rinnovo.",
  "notice.stillInEducation.title": "Ancora in formazione?",
  "rejectContent": "Sfortunatamente, non sei idoneo per lo status di Educazione Verificata e quindi non puoi ricevere il coupon esclusivo del 100% per il Piano Professionale Dify se usi questo indirizzo email.",
  "rejectTitle": "La tua verifica educativa Dify è stata rifiutata.",
  "submit": "Invia",
  "submitError": "Invio del modulo non riuscito. Per favore riprova più tardi.",
  "successContent": "Abbiamo emesso un coupon sconto del 100% per il piano Dify Professionale sul tuo account. Il coupon è valido per un anno, ti preghiamo di utilizzarlo entro il periodo di validità.",
  "successTitle": "Hai ottenuto l'istruzione Dify verificata",
  "toVerified": "Fai verificare la tua istruzione",
  "toVerifiedTip.coupon": "coupon esclusivo al 100%",
  "toVerifiedTip.end": "per il Piano Professionale Dify.",
  "toVerifiedTip.front": "Ora sei idoneo per lo stato di Educazione Verificata. Per favore, inserisci le tue informazioni educative qui sotto per completare il processo e ricevere un"
}
