{
  "currentSigned": "ATUALMENTE CONECTADO COMO",
  "emailLabel": "Seu e-mail atual",
  "form.schoolName.placeholder": "Digite o nome oficial e não abreviado da sua escola",
  "form.schoolName.title": "O nome da sua escola",
  "form.schoolRole.option.administrator": "Administrador Escolar",
  "form.schoolRole.option.student": "Estudante",
  "form.schoolRole.option.teacher": "Professor",
  "form.schoolRole.title": "Seu Papel na Escola",
  "form.terms.desc.and": "e",
  "form.terms.desc.end": "Ao enviar:",
  "form.terms.desc.front": "Suas informações e o uso do status de Educação Verificada estão sujeitos ao nosso",
  "form.terms.desc.privacyPolicy": "Política de Privacidade",
  "form.terms.desc.termsOfService": "Termos de Serviço",
  "form.terms.option.age": "Eu confirmo que tenho pelo menos 18 anos",
  "form.terms.option.inSchool": "Eu confirmo que estou matriculado ou empregado na instituição mencionada. A Dify pode solicitar comprovação de matrícula/emprego. Se eu representar indevidamente minha elegibilidade, concordo em pagar quaisquer taxas inicialmente isentas com base no meu status educacional.",
  "form.terms.title": "Termos e Acordos",
  "learn": "Aprenda como fazer a verificação da sua educação",
  "notice.action.dismiss": "Dispensar",
  "notice.action.reVerify": "Reverifique",
  "notice.action.upgrade": "Atualizar",
  "notice.alreadyGraduated.expired": "Sinta-se à vontade para atualizar a qualquer momento para obter acesso total aos recursos pagos.",
  "notice.alreadyGraduated.isAboutToExpire": "Sua assinatura atual ainda permanecerá ativa. Quando ela terminar, você será movido para o plano Sandbox, ou poderá fazer um upgrade a qualquer momento para restaurar o acesso completo aos recursos pagos.",
  "notice.alreadyGraduated.title": "Já se formou?",
  "notice.dateFormat": "DD/MM/AAAA",
  "notice.expired.summary.line1": "Você ainda pode acessar e usar o Dify.",
  "notice.expired.summary.line2": "No entanto, você não é mais elegível para novos cupons de desconto na educação.",
  "notice.expired.title": "Seu status de educação expirou",
  "notice.isAboutToExpire.summary": "Não se preocupe — isso não afetará sua assinatura atual, mas você não receberá o desconto educacional quando ela for renovada, a menos que você verifique seu status novamente.",
  "notice.isAboutToExpire.title": "Seu status educacional expirará em {{date}}",
  "notice.stillInEducation.expired": "Reveja agora para obter um novo cupom para o próximo ano acadêmico. Nós o adicionaremos à sua conta e você poderá usá-lo na próxima atualização.",
  "notice.stillInEducation.isAboutToExpire": "Verifique novamente agora para receber um novo cupom para o próximo ano acadêmico. Ele será salvo na sua conta e estará pronto para ser usado na sua próxima renovação.",
  "notice.stillInEducation.title": "Ainda na educação?",
  "rejectContent": "Infelizmente, você não é elegível para o status de Educação Verificada e, portanto, não pode receber o cupom exclusivo de 100% para o Plano Profissional Dify se usar este endereço de e-mail.",
  "rejectTitle": "A sua verificação educacional Dify foi rejeitada.",
  "submit": "Enviar",
  "submitError": "A submissão do formulário falhou. Por favor, tente novamente mais tarde.",
  "successContent": "Emitimos um cupom de desconto de 100% para o plano Dify Professional na sua conta. O cupom é válido por um ano, por favor, utilize-o dentro do período de validade.",
  "successTitle": "Você Tem a Educação Dify Verificada",
  "toVerified": "Verifique a Educação",
  "toVerifiedTip.coupon": "cupom exclusivo de 100%",
  "toVerifiedTip.end": "para o Plano Profissional Dify.",
  "toVerifiedTip.front": "Você agora está elegível para o status de Educação Verificada. Por favor, insira suas informações educacionais abaixo para concluir o processo e receber um"
}
