{
  "currentSigned": "DERZEIT ANGEMELDET ALS",
  "emailLabel": "Ihre aktuelle E-Mail",
  "form.schoolName.placeholder": "Geben Sie den offiziellen, unabgekürzten Namen Ihrer Schule ein.",
  "form.schoolName.title": "Ihr Schulname",
  "form.schoolRole.option.administrator": "Schuladministrator",
  "form.schoolRole.option.student": "Schüler",
  "form.schoolRole.option.teacher": "Lehrer",
  "form.schoolRole.title": "Ihre Schulrolle",
  "form.terms.desc.and": "und",
  "form.terms.desc.end": ". Durch die Einreichung:",
  "form.terms.desc.front": "Ihre Informationen und die Nutzung des Status \"Bildung bestätigt\" unterliegen unseren",
  "form.terms.desc.privacyPolicy": "Datenschutzrichtlinie",
  "form.terms.desc.termsOfService": "Nutzungsbedingungen",
  "form.terms.option.age": "Ich bestätige, dass ich mindestens 18 Jahre alt bin.",
  "form.terms.option.inSchool": "Ich bestätige, dass ich an der angegebenen Einrichtung eingeschrieben oder angestellt bin. Dify kann einen Nachweis über die Einschreibung/Anstellung anfordern. Wenn ich meine Berechtigung falsch darstelle, stimme ich zu, alle Gebühren zu zahlen, die aufgrund meines Bildungsstatus ursprünglich erlassen wurden.",
  "form.terms.title": "Allgemeine Geschäftsbedingungen",
  "learn": "Erfahren Sie, wie Sie Ihre Ausbildung überprüfen lassen.",
  "notice.action.dismiss": "Ablehnen",
  "notice.action.reVerify": "Überprüfen Sie es erneut",
  "notice.action.upgrade": "Upgrade",
  "notice.alreadyGraduated.expired": "Fühlen Sie sich frei, jederzeit ein Upgrade durchzuführen, um vollen Zugriff auf die kostenpflichtigen Funktionen zu erhalten.",
  "notice.alreadyGraduated.isAboutToExpire": "Ihr aktuelles Abonnement bleibt weiterhin aktiv. Wenn es endet, werden Sie auf den Sandbox-Plan umgestellt, oder Sie können jederzeit upgraden, um den vollen Zugang zu den kostenpflichtigen Funktionen wiederherzustellen.",
  "notice.alreadyGraduated.title": "Bereits abgeschlossen?",
  "notice.dateFormat": "MM/TT/JJJJ",
  "notice.expired.summary.line1": "Sie können weiterhin auf Dify zugreifen und es nutzen.",
  "notice.expired.summary.line2": "Allerdings sind Sie nicht mehr berechtigt, neue Bildungsgutscheine zu erhalten.",
  "notice.expired.title": "Ihr Bildungsstatus ist abgelaufen.",
  "notice.isAboutToExpire.summary": "Keine Sorge - das wird sich nicht auf Ihr aktuelles Abonnement auswirken, aber Sie werden den Bildungspreis beim nächsten Verzicht nicht erhalten, es sei denn, Sie überprüfen Ihren Status erneut.",
  "notice.isAboutToExpire.title": "Ihr Bildungsstatus läuft am {{date}} ab",
  "notice.stillInEducation.expired": "Überprüfen Sie jetzt erneut, um einen neuen Gutschein für das kommende akademische Jahr zu erhalten. Wir fügen ihn Ihrem Konto hinzu und Sie können ihn für das nächste Upgrade verwenden.",
  "notice.stillInEducation.isAboutToExpire": "Überprüfen Sie jetzt erneut, um einen neuen Gutschein für das kommende Studienjahr zu erhalten. Er wird in Ihrem Konto gespeichert und ist bereit zur Nutzung bei Ihrer nächsten Verlängerung.",
  "notice.stillInEducation.title": "Immer noch in der Ausbildung?",
  "rejectContent": "Leider sind Sie nicht für den Status \"Education Verified\" berechtigt und können daher den exklusiven 100%-Gutschein für den Dify Professional Plan nicht erhalten, wenn Sie diese E-Mail-Adresse verwenden.",
  "rejectTitle": "Ihre Dify-Ausbildungsüberprüfung wurde abgelehnt.",
  "submit": "Einreichen",
  "submitError": "Die Formularübermittlung ist fehlgeschlagen. Bitte versuchen Sie es später erneut.",
  "successContent": "Wir haben einen 100% Rabattgutschein für den Dify Professional Plan auf Ihr Konto ausgestellt. Der Gutschein ist ein Jahr lang gültig, bitte nutzen Sie ihn innerhalb des Gültigkeitszeitraums.",
  "successTitle": "Sie haben die Dify-Ausbildung verifiziert",
  "toVerified": "Bildung überprüfen lassen",
  "toVerifiedTip.coupon": "exklusiver 100% Gutschein",
  "toVerifiedTip.end": "für den Dify Professional Plan.",
  "toVerifiedTip.front": "Sie sind jetzt berechtigt, den Status „Bildung verifiziert“ zu erhalten. Bitte geben Sie unten Ihre Bildungsinformationen ein, um den Prozess abzuschließen und eine Zu erhalten."
}
