const translation = {
  creation: {
    createFromScratch: {
      title: 'خط لوله دانش خالی',
      description: 'یک پایپ لاین سفارشی از ابتدا با کنترل کامل بر پردازش و ساختار داده ایجاد کنید.',
    },
    caution: 'احتیاط',
    createKnowledge: 'ایجاد دانش',
    backToKnowledge: 'بازگشت به دانش',
    importDSL: 'ایمپورت از یک فایل DSL',
    successTip: 'با موفقیت یک پایگاه دانش ایجاد کرد',
    errorTip: 'ایجاد پایگاه دانش ناموفق است',
  },
  templates: {
    customized: 'سفارشی',
  },
  operations: {
    dataSource: 'منبع داده',
    details: 'جزئیات',
    convert: 'تبدیل',
    choose: 'انتخاب',
    preview: 'پیشنمایش',
    process: 'فرایند',
    editInfo: 'ویرایش اطلاعات',
    useTemplate: 'از این پایپ لاین دانش استفاده کنید',
    saveAndProcess: 'ذخیره و پردازش',
    backToDataSource: 'بازگشت به منبع داده',
    exportPipeline: 'خط لوله صادرات',
  },
  deletePipeline: {
    content: 'حذف الگوی خط لوله برگشت ناپذیر است.',
    title: 'آیا مطمئن هستید که این الگوی خط لوله را حذف می کنید؟',
  },
  publishPipeline: {
    success: {
      message: 'خط لوله دانش منتشر شد',
    },
    error: {
      message: 'انتشار پایپ لاین دانش ناموفق است',
    },
  },
  publishTemplate: {
    success: {
      learnMore: 'بیشتر بدانید',
      message: 'الگوی خط لوله منتشر شد',
      tip: 'می توانید از این الگو در صفحه ایجاد استفاده کنید.',
    },
    error: {
      message: 'انتشار الگوی خط لوله انجام نشد',
    },
  },
  exportDSL: {
    successTip: 'DSL خط لوله را با موفقیت صادر کنید',
    errorTip: 'صادرات DSL خط لوله انجام نشد',
  },
  details: {
    structure: 'ساختار',
    structureTooltip: 'ساختار Chunk نحوه تقسیم و نمایه سازی اسناد را تعیین می کند - حالت های عمومی، والد-فرزند و پرسش و پاسخ را ارائه می دهد - و برای هر پایگاه دانش منحصر به فرد است.',
  },
  testRun: {
    steps: {
      dataSource: 'منبع داده',
      documentProcessing: 'پردازش اسناد',
    },
    dataSource: {
      localFiles: 'فایل های محلی',
    },
    notion: {
      docTitle: 'اسناد مفهومی',
      title: 'صفحات مفهومی را انتخاب کنید',
    },
    title: 'اجرای آزمایشی',
    tooltip: 'در حالت اجرای آزمایشی، فقط یک سند مجاز به وارد کردن در یک زمان برای اشکال زدایی و مشاهده آسان تر است.',
  },
  inputFieldPanel: {
    uniqueInputs: {
      title: 'ورودی های منحصر به فرد برای هر ورودی',
      tooltip: 'ورودی های منحصر به فرد فقط برای منبع داده انتخاب شده و گره های پایین دستی آن قابل دسترسی هستند. کاربران هنگام انتخاب منابع داده دیگر نیازی به پر کردن آن نخواهند داشت. فقط فیلدهای ورودی که توسط متغیرهای منبع داده ارجاع داده شده اند در مرحله اول ظاهر می شوند (منبع داده). تمام فیلدهای دیگر در مرحله دوم (اسناد فرآیند) نشان داده می شوند.',
    },
    globalInputs: {
      title: 'ورودی های جهانی برای همه ورودی ها',
      tooltip: 'ورودی های جهانی در همه گره ها به اشتراک گذاشته می شوند. کاربران باید هنگام انتخاب هر منبع داده ای آنها را پر کنند. به عنوان مثال، فیلدهایی مانند جداکننده و حداکثر طول تکه را می توان به طور یکنواخت در چندین منبع داده اعمال کرد. فقط فیلدهای ورودی که توسط متغیرهای منبع داده ارجاع داده می شوند در مرحله اول ظاهر می شوند (منبع داده). تمام فیلدهای دیگر در مرحله دوم نشان داده می شوند (اسناد پردازش).',
    },
    preview: {
      stepOneTitle: 'منبع داده',
      stepTwoTitle: 'اسناد پردازش',
    },
    error: {
      variableDuplicate: 'نام متغیر از قبل وجود دارد. لطفا نام دیگری را انتخاب کنید.',
    },
    addInputField: 'افزودن فیلد ورودی',
    title: 'فیلدهای ورودی کاربر',
    editInputField: 'ویرایش فیلد ورودی',
    description: 'فیلدهای ورودی کاربر برای تعریف و جمع آوری متغیرهای مورد نیاز در طول فرآیند اجرای خط لوله استفاده می شود. کاربران می توانند نوع فیلد را سفارشی کنند و مقدار ورودی را به طور انعطاف پذیر پیکربندی کنند تا نیازهای منابع داده مختلف یا مراحل پردازش سند را برآورده کنند.',
  },
  addDocuments: {
    steps: {
      processDocuments: 'اسناد پردازش',
      processingDocuments: 'پردازش اسناد',
      chooseDatasource: 'یک منبع داده را انتخاب کنید',
    },
    stepOne: {
      preview: 'پیشنمایش',
    },
    stepTwo: {
      chunkSettings: 'تنظیمات تکه',
      previewChunks: 'پیش نمایش تکه ها',
    },
    stepThree: {
      learnMore: 'بیشتر بدانید',
    },
    backToDataSource: 'منبع داده',
    characters: 'کاراکتر',
    title: 'اسناد را اضافه کنید',
  },
  documentSettings: {
    title: 'تنظیمات سند',
  },
  onlineDocument: {},
  onlineDrive: {
    breadcrumbs: {
      allFiles: 'همه فایل ها',
      searchPlaceholder: 'فایل های جستجو...',
      allBuckets: 'همه سطل های ذخیره سازی ابری',
    },
    emptyFolder: 'این پوشه خالی است',
    resetKeywords: 'بازنشانی کلمات کلیدی',
    emptySearchResult: 'هیچ موردی یافت نشد',
    notSupportedFileType: 'این نوع فایل پشتیبانی نمی شود',
  },
  credentialSelector: {},
  conversion: {
    confirm: {
      title: 'تایید',
      content: 'این عمل دائمی است. نمی توانید به روش قبلی برگردید. لطفا برای تبدیل تأیید کنید.',
    },
    title: 'تبدیل به پایپ لاین دانش',
    warning: 'این عمل قابل برگشت نیست.',
    errorMessage: 'تبدیل مجموعه داده به خط لوله انجام نشد',
    successMessage: 'مجموعه داده را با موفقیت به یک خط لوله تبدیل کرد',
    descriptionChunk2: '- یک رویکرد بازتر و انعطاف پذیرتر با دسترسی به افزونه ها از بازار ما. این روش پردازش جدید را برای تمام اسناد آینده اعمال می کند.',
    descriptionChunk1: 'اکنون می توانید پایگاه دانش موجود خود را برای استفاده از خط لوله دانش برای پردازش اسناد تبدیل کنید',
  },
  knowledgePermissions: 'مجوزهای',
  inputField: 'فیلد ورودی',
  knowledgeNameAndIcon: 'نام و نماد دانش',
  knowledgeDescription: 'شرح دانش',
  pipelineNameAndIcon: 'نام و نماد خط لوله',
  editPipelineInfo: 'ویرایش اطلاعات خط لوله',
  knowledgeNameAndIconPlaceholder: 'لطفا نام پایگاه دانش را وارد کنید',
  knowledgeDescriptionPlaceholder: 'آنچه در این پایگاه دانش وجود دارد را شرح دهید. توضیحات دقیق به هوش مصنوعی اجازه می دهد تا با دقت بیشتری به محتوای مجموعه داده دسترسی داشته باشد. اگر خالی باشد، Dify از استراتژی ضربه پیش فرض استفاده می کند. (اختیاری)',
}

export default translation
