"""Abstract interface for document loader implementations."""

from core.rag.splitter.fixed_text_splitter_ext import (
    EnhanceRecursiveCharacterTextSplitter,
    FixedRecursiveCharacterTextSplitter,
)
from services.ext.read_file_service import ReadPdfService
class BaseIndexExtProcessor:
    def _get_splitter(
        self,
    ):
        text = """作战系统
5. 综合主进度
综合主计划与综合主进度编制与使用指南
30
由于可以将实际进度与计划进度进行比较，因此综合主进度是提供指标衡量以及评估剩
余工作范围和时间的关键。
5.3 制定综合主进度
5.3.1 审查综合主计划
制定综合主进度的第一步是审查综合主计划的事件、成就和标准，以及综合主计划中的
政府和承包商业务流程。综合主进度将以综合主计划的结构为基础，进一步列出任务和
详细工作包。
工作包指的是一组相关的任务或活动，将它们作为一个整体进行管理。与规划包不同的
是，工作包中包括挣值管理的任务，即描述如何计算计划工作预算费用（也称为挣值）。
综合主进度中使用的事件、成就和标准的描述性标签应与综合主计划中使用的标签相同。
每个事件、成就和标准都应标注简短的描述性标题，并进行编号或编码，以便与综合主
计划联系起来。如此一来，综合主进度的任务便可直接追溯到综合主计划。
综合主进度列出了实现每项综合主计划标准、成就和事件的计划日期，以及实现这些标
准、成就和事件所需执行的详细任务的预估时长。因此，只有在制定了综合主进度后，
项目组才能确定完成综合主计划时间的预期日期。
综合主进度本身通常不具有合同约束力，因为随着项目的进行，日期可能会发生变化，
而且实际进度可能与计划估算不符。此外，详细任务可能会因各种原因发生变化，但这
并不会影响标准的有效性或达成。综合主进度是一份动态文件，需要随着项目的进展而
不断变更完善。因此，利益相关者和进度计划团队应定期会面，更新进度计划并确定其
状态。综合主进度中确定资源可用性的日期并非正式日期，而是针对任务完成的实际预
期。为确保综合主进度由事件驱动，而不是由进度驱动，项目应坚持在执行事件前完成
事件的所有进入标准。
顺序可能因情况而异，但基于综合主计划制定 综合主进度的常用步骤如下（图5-3）：
1. 确定项目目标：项目目标直接来源于工作说明书或合同工作说明书。工作说明书
明确定义了项目范围，包括目标和交付成果。此外，确定项目目标还有助于确定
项目范围、要求和时间线。
2. 创建或采用工作分解结构：工作分解结构按层次将项目活动分解为更小、更易于
管理的组成部分。
3. 制定综合主计划：综合主计划是对整个项目的高层次概述，
包括目的、目标和主要里程碑。虽然综合主计划以工作分
解结构为依据，但它通常与工作分解结构同时制定。
4. 定义组织分解结构：组织分解结构是一个层次模型或图表，
用于表示组织结构，确定不同部门、团队和个人之间的关
系。它直观地展示了组织结构及其内部的汇报关系。组织
分解结构通常用于为特定的个人、团队或部门分配职能，
在特定的控制账户内执行特定的项目任务或活动。它还用
于确定详细工作（主要是确定任务，可将控制账户分解为
工作，将规划包分解为任务）。
5. 制定综合主进度：
o 定义任务（时长和逻辑）
o 确定资源可用性
o 确定里程碑：通过确定里程碑，可以将综合主进度与
综合主计划和工作分解结构联系起来。
6. 构建综合主进度网络图（逻辑纽带）：
o 验证综合主进度
o 调整网络图
o 设置综合主进度基
线
7. 确定关键路径
图5-3：综合主进度制定流程
8. 制定状态监测和报告计划
确定关键路径
提供报告和
分析
设置
IMS
基线
调整网
络图&
获得同
意
监测IMS状态
/控制基线变
更
确定里
程碑
构建IMS
网络
验证
IMS
确定资
源可用
性
定义任
务（时
长和逻
辑）
记录工作责任方
（OBS）
制定
IMP
创建
WBS
确定项目目
标(SOW)
5. 综合主进度
综合主计划与综合主进度编制与使用指南
32
o 综合主进度状态/控制基线变化：综合主进度状态是指项目目前相对于计划进度
的进展情况。综合主进度状态可以有多种，例如：
 正按计划进行：项目按照计划进度推进，任务按时完成且未超出预算。
 进度落后：项目进展与计划不符，任务完成时间晚于预期。这可能是由于
延误、资源限制或意外问题等因素造成的。
 进度提前：项目进度快于预期，任务提前完成。这可能是由于项目计划的
效率或意想不到的机会等因素造成的。
 面临风险：项目面临进度落后或超出预算的风险。
o 提供报告和分析：报告和分析通常侧重于跟踪项目进度，并确定可能影响项目
时间线或预算的潜在延误或问题。
5.3.2 编制综合主进度文件
通常情况下，除综合主进度外，每个投标方还会创建并提交一份综合主进度文件，其中
包括对其制定进度的方法进行解释，对如何使用电子文档进行说明，以及确定所定义的
字段。该文件是为了方便评估，并允许投标方提供有关综合主进度的补充信息。下文为
综合主进度文件的推荐编排格式。这一格式可根据需要进行调整，以满足各个项目的需
求。
第1节：引言部分，内容包括：
 简要概述综合主进度。
 介绍编制综合主进度的假定和基本准则（如采用的日历、节假日限制等）。
 介绍综合主进度的独特功能，如：
o 编号体系说明
o 包含其他数据字段（标识相关文本或其他字段）
o 说明应如何管理综合主进度及其更改。
第2节：为长时任务、非“尽快完成(ASAP)”的任务约束条件，或提前或滞后时间过长等进
度情况提供依据。应避免提前，但如果在进度中采用了提前，则需要加以解释。
第3节：对投标方在甘特图或表格形式进度表中所用方法的关键要素以及项目关键路径进
行说明。关键路径在报告格式中应易于区分。本节也适合用于论述投标方开展的任何进
度风险评估（SRA）。
5. 综合主进度
综合主计划与综合主进度编制与使用指南
33
第4节：招标书要求或投标方确定的综合主进度术语和缩略语词汇表。
第5节：简明进度表（甘特图格式：通常为一页，但复杂项目可能不止一页；表格格式）。
5.3.3 定义项目管理工具设置和属性
项目管理工具（即进度计划软件工具）是否十分有用取决于所跟踪的信息以及输入的数
据是否准确。
在将“事件”、“成就”、“标准”和“任务”输入进度计划软件工具之前，用户应首先熟悉其所
在单位使用的软件。如果所在单位没有标准的软件排程模板，排程人员就必须建立一个
模板。建立模板包括设置自动编号体系；确定哪些字段是必填字段（日期、时长、成本
等）；创建带有节假日和其他与项目管理团队相关的独特日期的自定义日历，例如定期
举行的集成产品团队会议；为当前更新周期确定状态日期；以及确认任务已设置为“自动
计划”。
自动编号：自动编号可防止重复编号，并提供从特定里程碑到完成该里程碑所需的工作
包和规划包的逻辑流程。综合主进度编号体系如图5-4所示。各单位可根据自身组织需求
和项目管理工具开发自己的编号体系。
图5-4：综合主进度编号体系
1.1.3.3 (依据WBS编号体系)
任务
标准
成就
事件
5. 综合主进度
综合主计划与综合主进度编制与使用指南
34
各项任务通过属性进一步细化。这些属性为每个任务提供了更多细节。一些常见的属性
包括：
 开始：任务和项目计划开始日期。
 时长：完成一项任务的总时间。
 完成：任务和项目计划完成日期。
 开始：任务和项目计划开始日期。
 实际完成：任务和项目实际完成日期。
 资源：完成任务所需的人员、设备和材料。
 前置任务：必须在另一项任务开始之前完成的任务。
 后继任务：必须在另一项任务结束之后完成的任务。
 关键：关键路径任务。关键路径任务必须按时完成，以确保项目按进度进行。关
键路径可根据综合主进度的更新而变更。
 其他属性：包括工作完成百分比、费用、实际开始时间、实际完成时间、分配任
务、预算相关属性、成本、成本差异等。
 项目开始日期：团队应通过输入项目开始日期来启动综合主进度。在团队输入任
务、任务开始日期、时长以及前置任务和后继任务关系时，输入此项内容应使项
目管理软件工具能够自动生成其余的开始和完成日期。
 初始栏目设置：综合主进度的制定分为几个阶段。第一阶段包括输入综合主计划
信息和与 综合主计划标准相关的综合主进度任务。启动综合主进度最初需要的栏
目包括工作分解结构、任务名称、时长、开始时间、完成时间、前置任务和后继
任务、任务名称、时长、开始时间、完成时间、前置任务和后继任务（图5-5）。
图5-5：初始栏目设置
5.3.4 开发任务
各集成产品团队应通过确定哪些任务是支持综合主计划所必需的，从而制定自己的综合
主进度。集成产品团队应提供每项任务的任务名称（包括使动动词）、时长以及与其他
任务的关系（前置任务和后继任务）。这样就可以确定项目的关键路径。进度风险评估
可能需要提供最短和最长用时的信息。集成产品团队还应利用工作分解结构字典（其中
列出并定义了工作分解结构要素），与综合主进度划与综合主进度联络人确认每项任务
的相关工作分解结构要素。
集成
产品
团队
资源
前置任务 后继任务 名称
完
成
开
任务名称 时长 始
5. 综合主进度
综合主计划与综合主进度编制与使用指南
35
建立综合主计划与综合主进度是一个反复的过程。如果集成产品团队在构建综合主进度
时发现所需的任务在逻辑上不属于现有的综合主计划标准，则应建议将这些任务归入其
他标准或成就。从事件到成就，再到标准，最后到任务，应该始终逻辑清晰。如果某项
任务没有合理的工作分解结构归属，则应调整工作分解结构。工作分解结构可以帮助政
府和承包商评估项目的进度和成熟度，并确保项目由事件驱动。
在定义综合主进度的任务时，项目可能需要增加更多层级的契约或子任务，以获得集成
产品团队所需的细节，并进一步定义工作包。对于综合主进度中更高层次的任务（用于
说明主要分包商执行的任务）而言，尤其如此。当要求主承包商提供综合主进度时，该
承包商综合主进度中的某项任务，可能在分包商的内部综合主进度中被进一步细分为子
任务。根据关键程度，主承包商的综合主进度可能会将任务细分为子任务。细分为子任
务是一种常见现象，而且与综合主计划与综合主进度的结构和理念相一致。在细分子任
务时，编号体系只需进一步定义或扩展（如扩展为D01a02a或D01a02.1）。
5.3.5 预估任务时长
一旦计划中确定了综合主进度的任务，就需要预估这些任务的时长，并确定与任务相关
的活动。这一步骤需要各种类型的信息，包括但不限于：
 历史数据：关于完成某些任务和活动所需时间的历史数据。
 资源可用性：所需资源的可用性会对任务和活动的时长产生重大影响。
 任务依赖性：相互依赖的任务和活动及其执行顺序会影响时长。
 工作时间与非工作时间：关于工作时间的规定，如每天工作8小时还是10小时、每
周工作5天还是7天等，会影响进度。
 资源质量：人员经验是否丰富，设施和设备是否合格先进，这些与资源质量相关
的因素对完成一项活动所需的时间有重要影响。
5. 综合主进度
综合主计划与综合主进度编制与使用指南
36
 风险因素：这指的是可能影响任务时长的潜在事件或条件。识别和评估潜在风险
因素有助于制定应急计划，更准确地估算任务和活动所需的时长。
任务时长估算技术用于预测完成特定进度任务和活动所需的时间。各种估算技术包括：
5.3.5.1 类比估算：这一技术也称为自上而下估算，包括将当前项目与过去的类似项目进
行比较。分析人员将过去和当前项目的类似任务进行比较，包括制造技术、材料、流程、
设备、设施、法规和数量等方面的差异。类比估算主要用于项目信息有限的情况。
5.3.5.2 三点估算：这一技术也称为计划评估与审查技术(PERT)。顾名思义，它是为每项
任务提供三种估算：
 乐观估算：这是一种最佳情况下的估算，假设一切均按计划进行。
 悲观估算：这是一种最糟糕情况下的估算，假设一切都会出错。估算引入的问题
包括供应商延误、人力短缺和其他可能导致进度问题的问题集。
 最有可能的估算：这是一种根据正常情况和潜在挑战做出的最现实的估算，介于
乐观和悲观估算之间。
确定这些估算值后，计算加权平均值，可以得出最终估算值。三点进度估算技术考虑了
每项任务或活动的不确定性和可变性。
5.3.5.3 参数估算：这种方法使用统计数据，根据类似项目的历史数据估算任务的时长。
参数化进度计划通常需要大量的数据和统计分析来开发精确的模型。这些模型可能受到
项目规模、复杂性和团队生产率等因素的影响。这种方法还可能需要考虑市场趋势、技
术进步和监管要求等外部因素。参数估算技术是一种强大的工具，但必须确保所使用历
史数据的相关性和准确性。
5.3.5.4 单点估算：单点估算是专业领域专家对任务时长可能是多少的看法。它的优点是
简单、易于沟通，并有助于快速决策。缺点是可能不准确，没有误差余地，提供的洞察
力有限。
5. 综合主进度
综合主计划与综合主进度编制与使用指南
37
关于如何估算进度时长，请参考组织政策和程序。
5.3.6 审查任务时长问题
长时任务：根据国防合同管理局的规定，任何超过44天的任务或活动均为长时任务。如
果综合主进度中存在长时任务（与状态间隔时长不相等的活动），团队应审查这些任务，
以确定是否应进一步细分。如果不应进一步细分，政府或承包商需在综合主进度文件中
说明理由（图5-6）。
在项目执行过程中，项目活动可能需要进一步界定，并分解为时长较短的活动单元。长
时任务的缺点包括可能会曲解关键路径，使进度难以衡量。在下述示例中，通用战车的
作战评估还可以进一步细分为子任务（例如，进行每个阶段的测试，以及为每个阶段的
测试运进或运出测试设备）。
图5-6：长时任务示例
提前期（应避免）：提前期（也称负滞后）指的是比前置任务开始或结束提前了一段时
间。由于复杂性、风险增加和缺乏精确性，应避免这些依赖关系。提前期的示例如图5-7
所示。在此示例中，分析数据并生成作战评估I测试报告的任务被安排在各自的前置任务
之前启动。由于可以对早期测试活动的数据进行分析，并在测试事件完成时编写测试报
告，因此这样的进度安排是可以实现的。更多信息请参阅有关提前期的组织政策。
逻辑依据
完
成
开
始
用于整理、分析和报告数据的典型时长。
150天
120天
时长
200天
OA有四个连续的阶段：射击、水陆两栖、沙
漠和寒冷气候。
执行测试后的数据整理、分析和报告编写
任务名称
当前供应系统中不包括通常用于申购特殊维修
用品的时间
进行通用战车OA
采购OA维修区块的维修部件
"""
        """
        Get the NodeParser object according to the processing rule.
        """
        character_splitter = FixedRecursiveCharacterTextSplitter.from_encoder(
            chunk_size=500,
            chunk_overlap=50,
            fixed_separator="@@@@@",
            separators=["\n\n", "\n", "。", "？", "！", "）", "：", ". ", "?", "，", "!", ")", ":", ",", "#", "”", " "],
        )

        pdf_text = ReadPdfService().load_content(pdf_file_path=r"D:\a.pdf")

        # print(pdf_text)

        document_nodes = character_splitter.split_text(pdf_text)
        for document in document_nodes:
            print("---------")
            print(document)


if __name__ == "__main__":
    indexExtProcessor = BaseIndexExtProcessor()
    indexExtProcessor._get_splitter()