const translation = {
  creation: {
    createFromScratch: {
      title: 'खाली ज्ञान पाइपलाइन',
      description: 'शुद्ध रूप से डेटा प्रोसेसिंग और ढांचे पर पूर्ण नियंत्रण के साथ एक कस्टम पाइपलाइन बनाएँ।',
    },
    backToKnowledge: 'ज्ञान की ओर वापस',
    createKnowledge: 'ज्ञान उत्पन्न करें',
    caution: 'सावधानी',
    importDSL: 'एक DSL फ़ाइल से आयात करें',
    errorTip: 'ज्ञान आधार बनाने में विफल',
    successTip: 'सफलता से एक ज्ञान आधार बनाया गया',
  },
  templates: {
    customized: 'कस्टमाइज़ किया गया',
  },
  operations: {
    dataSource: 'डेटा स्रोत',
    backToDataSource: 'डेटा स्रोत पर वापस',
    choose: 'चुनें',
    saveAndProcess: 'सहेजें और प्रक्रिया करें',
    convert: 'रूपांतरित करें',
    useTemplate: 'इस ज्ञान पाइपलाइन का उपयोग करें',
    editInfo: 'जानकारी संपादित करें',
    exportPipeline: 'निर्यात पाइपलाइन',
    details: 'विवरण',
    preview: 'पूर्वावलोकन',
    process: 'प्रक्रिया',
  },
  deletePipeline: {
    title: 'क्या आप इस पाइपलाइन टेम्पलेट को हटाने के लिए निश्चित हैं?',
    content: 'पाइपलाइन टेम्पलेट को हटाना वापस नहीं किया जा सकता।',
  },
  publishPipeline: {
    success: {
      message: 'ज्ञान पाइपलाइन प्रकाशित',
    },
    error: {
      message: 'ज्ञान पाइपलाइन प्रकाशित करने में विफल रहा',
    },
  },
  publishTemplate: {
    success: {
      learnMore: 'और जानें',
      tip: 'आप इस टेम्पलेट का उपयोग निर्माण पृष्ठ पर कर सकते हैं।',
      message: 'पाइपलाइन टेम्पलेट प्रकाशित',
    },
    error: {
      message: 'पाइपलाइन टेम्पलेट को प्रकाशित करने में असफल हुआ',
    },
  },
  exportDSL: {
    errorTip: 'पाइपलाइन DSL निर्यात करने में विफल',
    successTip: 'निर्यात पाइपलाइन DSL सफलतापूर्वक',
  },
  details: {
    structure: 'संरचना',
    structureTooltip: 'चंक संरचना यह निर्धारित करती है कि दस्तावेज कैसे विभाजित और अनुक्रमित होते हैं—सामान्य, माता-पिता- बच्चे, और प्रश्नोत्तर मोड प्रदान करते हुए—और यह प्रत्येक ज्ञान आधार के लिए अद्वितीय होती है।',
  },
  testRun: {
    steps: {
      dataSource: 'डेटा स्रोत',
      documentProcessing: 'दस्तावेज़ प्रसंस्करण',
    },
    dataSource: {
      localFiles: 'स्थानीय फ़ाइलें',
    },
    notion: {
      docTitle: 'नोटियन दस्तावेज़',
      title: 'नोटियन पृष्ठों का चयन करें',
    },
    title: 'परीक्षण चलाना',
    tooltip: 'परीक्षण रन मोड में, एक समय में केवल एक दस्तावेज़ को आयात करने की अनुमति है ताकि डिबगिंग और अवलोकन को आसान बनाया जा सके।',
  },
  inputFieldPanel: {
    uniqueInputs: {
      title: 'प्रत्येक प्रवेश के लिए अद्वितीय इनपुट',
      tooltip: 'असाधारण इनपुट केवल चयनित डेटा स्रोत और इसके डाउनस्ट्रीम नोड्स के लिए सुलभ हैं। उपयोगकर्ताओं को अन्य डेटा स्रोत चुनते समय इसे भरने की आवश्यकता नहीं होगी। केवल उन इनपुट फ़ील्ड्स जो डेटा स्रोत वेरिएबल द्वारा संदर्भित हैं, पहले चरण (डेटा स्रोत) में दिखाई देंगे। सभी अन्य फ़ील्ड दूसरे चरण (डॉक्यूमेंट्स प्रक्रिया) में दिखाई देंगी।',
    },
    globalInputs: {
      title: 'सभी प्रवेशों के लिए वैश्विक इनपुट',
      tooltip: 'वैश्विक इनपुट सभी नोड्स में साझा किए जाते हैं। उपयोगकर्ताओं को किसी भी डेटा स्रोत को चुनते समय इन्हें भरना होगा। उदाहरण के लिए, विभाजक और अधिकतम खंड की लंबाई जैसे फ़ील्ड को कई डेटा स्रोतों में समान रूप से लागू किया जा सकता है। केवल इनपुट फ़ील्ड जो डेटा स्रोत परिवर्तनीयों द्वारा संदर्भित होते हैं, पहले चरण (डेटा स्रोत) में दिखाई देते हैं। सभी अन्य फ़ील्ड दूसरे चरण (प्रक्रिया दस्तावेज़) में दिखाई देते हैं।',
    },
    preview: {
      stepOneTitle: 'डेटा स्रोत',
      stepTwoTitle: 'दस्तावेज़ संसाधित करें',
    },
    error: {
      variableDuplicate: 'चर नाम पहले से मौजूद है। कृपया एक अलग नाम चुनें।',
    },
    addInputField: 'इनपुट फ़ील्ड जोड़ें',
    editInputField: 'इनपुट फ़ील्ड संपादित करें',
    title: 'उपयोगकर्ता इनपुट फ़ील्ड्स',
    description: 'उपयोगकर्ता इनपुट फ़ील्ड्स का उपयोग पाईपलाइन निष्पादन प्रक्रिया के दौरान आवश्यक वेरिएबल्स को परिभाषित और इकट्ठा करने के लिए करते हैं। उपयोगकर्ता फ़ील्ड प्रकार को कस्टमाइज़ कर सकते हैं और विभिन्न डेटा स्रोतों या दस्तावेज़ प्रसंस्करण चरणों की आवश्यकताओं को पूरा करने के लिए इनपुट मान को लचीले ढंग से कॉन्फ़िगर कर सकते हैं।',
  },
  addDocuments: {
    steps: {
      chooseDatasource: 'डेटा स्रोत चुनें',
      processDocuments: 'दस्तावेज़ संसाधित करें',
      processingDocuments: 'दस्तावेज़ संसाधित करना',
    },
    stepOne: {
      preview: 'पूर्वावलोकन',
    },
    stepTwo: {
      previewChunks: 'पूर्वावलोकन खंड',
      chunkSettings: 'चंक सेटिंग्स',
    },
    stepThree: {
      learnMore: 'और अधिक सीखें',
    },
    backToDataSource: 'डेटा स्रोत',
    characters: 'पात्र',
    title: 'दस्तावेज़ जोड़ें',
  },
  documentSettings: {
    title: 'डॉक्यूमेंट सेटिंग्स',
  },
  onlineDocument: {},
  onlineDrive: {
    breadcrumbs: {
      allFiles: 'सभी फ़ाइलें',
      searchPlaceholder: 'फाइलें खोजें...',
      allBuckets: 'सभी क्लाउड स्टोरेज बकेट्स',
    },
    resetKeywords: 'कीवर्ड रीसेट करें',
    emptyFolder: 'यह फ़ोल्डर खाली है',
    notSupportedFileType: 'यह फ़ाइल प्रकार समर्थित नहीं है',
    emptySearchResult: 'कोई सामान नहीं मिला',
  },
  credentialSelector: {},
  conversion: {
    confirm: {
      title: 'पुष्टि',
      content: 'यह कार्रवाई स्थायी है। आप पिछले तरीके पर वापस नहीं जा पाएंगे। कृपया परिवर्तन की पुष्टि करें।',
    },
    title: 'ज्ञान पाइपलाइन में परिवर्तित करें',
    warning: 'यह क्रिया पूर्ववत नहीं की जा सकती।',
    descriptionChunk1: 'आप अब अपने मौजूदा ज्ञान आधार को दस्तावेज़ प्रसंस्करण के लिए ज्ञान पाइपलाइन में बदल सकते हैं',
    errorMessage: 'डेटासेट को पाइपलाइन में परिवर्तित करने में विफल रहा',
    successMessage: 'डेटासेट को एक पाइपलाइन में सफलतापूर्वक रूपांतरित किया गया है',
    descriptionChunk2: '— एक अधिक खुला और लचीला दृष्टिकोण जो हमारे मार्केटप्लेस से प्लगइन्स तक पहुंच प्रदान करता है। यह नए प्रसंस्करण पद्धति को सभी भविष्य के दस्तावेजों पर लागू करेगा।',
  },
  knowledgePermissions: 'अनुमतियाँ',
  knowledgeNameAndIcon: 'ज्ञान का नाम और आइकन',
  knowledgeNameAndIconPlaceholder: 'कृपया ज्ञान बेस का नाम दर्ज करें',
  knowledgeDescription: 'ज्ञान का वर्णन',
  pipelineNameAndIcon: 'पाइपलाइन का नाम और आइकन',
  inputField: 'इनपुट फ़ील्ड',
  editPipelineInfo: 'पाइपलाइन जानकारी संपादित करें',
  knowledgeDescriptionPlaceholder: 'इस ज्ञान आधार में क्या है इसका वर्णन करें। एक विस्तृत विवरण एआई को डेटा सेट की सामग्री को अधिक सटीकता से एक्सेस करने की अनुमति देता है। यदि खाली है, तो डिफी डिफ़ॉल्ट हिट रणनीति का उपयोग करेगा। (वैकल्पिक)',
}

export default translation
