const translation = {
  toVerifiedTip: {
    coupon: 'विशेष 100% कूपन',
    front: 'आप अब शिक्षा सत्यापित स्थिति के लिए योग्य हैं। कृपया नीचे अपनी शिक्षा की जानकारी प्रदान करें ताकि प्रक्रिया को पूरा किया जा सके और एक प्राप्त हो सके',
    end: 'Dify प्रोफेशनल योजना के लिए।',
  },
  form: {
    schoolName: {
      placeholder: 'अपनी स्कूल का आधिकारिक, बिना संक्षिप्त नाम दर्ज करें',
      title: 'आपके स्कूल का नाम',
    },
    schoolRole: {
      option: {
        administrator: 'स्कूल प्रशासक',
        student: 'छात्र',
        teacher: 'शिक्षक',
      },
      title: 'आपकी स्कूल की भूमिका',
    },
    terms: {
      desc: {
        and: 'और',
        termsOfService: 'सेवाओं की शर्तें',
        privacyPolicy: 'गोपनीयता नीति',
        end: '. प्रस्तुत करके:',
        front: 'आपकी जानकारी और शिक्षा सत्यापित स्थिति का उपयोग हमारी शर्तों के अधीन है।',
      },
      option: {
        age: 'मैं पुष्टि करता हूँ कि मैं कम से कम 18 साल का हूँ',
        inSchool: 'मैं पुष्टि करता हूँ कि मैं दी गई संस्थान में नामांकित या नियुक्त हूं। Dify नामांकन/नियुक्ति का प्रमाण मांग सकता है। यदि मैं अपनी पात्रता का गलत वर्णन करता हूं, तो मैं सहमत हूं कि मैं अपने शिक्षा स्थिति के आधार पर किसी भी शुल्क का भुगतान करूं जो प्रारंभ में माफ किया गया था।',
      },
      title: 'नियम और शर्तें',
    },
  },
  submitError: 'फॉर्म जमा करने में विफलता हुई। कृपया बाद में पुनः प्रयास करें।',
  currentSigned: 'वर्तमान में साइन इन किया गया है के रूप में',
  learn: 'शिक्षा को प्रमाणित कराने का तरीका सीखें',
  toVerified: 'शिक्षा की पुष्टि कराएँ',
  emailLabel: 'आपका वर्तमान ईमेल',
  submit: 'सबमिट करें',
  rejectTitle: 'आपकी डिफाई शैक्षणिक सत्यापन को अस्वीकृत कर दिया गया है',
  successTitle: 'आपकी डिफाई शिक्षा को सत्यापित किया गया है',
  successContent: 'हमने आपकी खाते के लिए Dify प्रोफेशनल योजना के लिए 100% छूट कूपन जारी किया है। यह कूपन एक वर्ष के लिए मान्य है, कृपया इसे मान्यता की अवधि के भीतर उपयोग करें।',
  rejectContent: 'दुर्भाग्यवश, आप शिक्षा सत्यापित स्थिति के लिए योग्य नहीं हैं और इसलिए यदि आप इस ईमेल पते का उपयोग करते हैं, तो आप डिफाई प्रोफेशनल योजना के लिए विशेष 100% कूपन प्राप्त नहीं कर सकते।',
  notice: {
    expired: {
      summary: {
        line1: 'आप अभी भी Dify का उपयोग कर सकते हैं और इसे एक्सेस कर सकते हैं।',
        line2: 'हालाँकि, आप नए शिक्षा छूट कूपनों के लिए अब योग्य नहीं हैं।',
      },
      title: 'आपकी शिक्षा स्थिति समाप्त हो गई है',
    },
    isAboutToExpire: {
      summary: 'चिंता मत करो — यह आपके वर्तमान सदस्यता पर प्रभाव नहीं डालेगा, लेकिन जब यह नवीनीकरण होगा तो आपको शिक्षा छूट नहीं मिलेगी जब तक कि आप अपनी स्थिति को फिर से सत्यापित नहीं करते।',
    },
    stillInEducation: {
      title: 'क्या आप अभी भी शिक्षा में हैं?',
      isAboutToExpire: 'अब फिर से सत्यापित करें ताकि आगामी शैक्षणिक वर्ष के लिए एक नया कूपन मिल सके। यह आपके खाते में सहेजा जाएगा और आपकी अगली नवीनीकरण पर उपयोग के लिए तैयार होगा।',
      expired: 'अब पुनः सत्यापित करें ताकि आप आगामी शैक्षणिक वर्ष के लिए एक नया कूपन प्राप्त कर सकें। हम इसे आपके खाते में जोड़ देंगे और आप इसे अगले अपग्रेड के लिए उपयोग कर सकेंगे।',
    },
    alreadyGraduated: {
      title: 'क्या आप पहले ही स्नातक हो चुके हैं?',
      expired: 'किसी भी समय अपग्रेड करने में संकोच न करें ताकि आपको सशुल्क सुविधाओं तक पूर्ण पहुँच मिल सके।',
      isAboutToExpire: 'आपकी वर्तमान सदस्यता अभी भी सक्रिय रहेगी। जब यह समाप्त होगी, तो आपको सैंडबॉक्स योजना में स्थानांतरित किया जाएगा, या आप कभी भी भुगतान सुविधाओं तक पूरी पहुंच बहाल करने के लिए अपग्रेड कर सकते हैं।',
    },
    action: {
      dismiss: 'अस्वीकृत करें',
      upgrade: 'अपग्रेड करें',
      reVerify: 'पुनः सत्यापित करें',
    },
    dateFormat: 'MM/DD/YYYY',
  },
}

export default translation
