const translation = {
  common: {
    publishAsPipeline: {
      name: 'पाइपलाइन का नाम और आइकन',
      description: 'ज्ञान का वर्णन',
      namePlaceholder: 'कृपया इस ज्ञान पाइपलाइन का नाम दर्ज करें। (आवश्यक)',
      descriptionPlaceholder: 'कृपया इस ज्ञान पाइपलाइन का वर्णन दर्ज करें। (वैकल्पिक)',
    },
    testRun: 'परीक्षण चलाना',
    preparingDataSource: 'डेटा स्रोत की तैयारी करना',
    reRun: 'फिर से चलाएँ',
    confirmPublish: 'प्रकाशित करने की पुष्टि करें',
    publishAs: 'ज्ञान पाइपलाइन के रूप में प्रकाशित करें',
    processing: 'प्रसंस्करण',
    goToAddDocuments: 'दस्तावेज़ जोड़ने के लिए जाएं',
    confirmPublishContent: 'ज्ञान पाइपलाइन को सफलतापूर्वक प्रकाशित करने के बाद, इस ज्ञान आधार की टुकड़ा संरचना को संशोधित नहीं किया जा सकता। क्या आप निश्चित हैं कि आप इसे प्रकाशित करना चाहते हैं?',
  },
  inputField: {
    create: 'उपयोगकर्ता इनपुट क्षेत्र बनाएं',
    manage: 'प्रबंधित करें',
  },
  publishToast: {
    title: 'यह पाइपलाइन अभी तक प्रकाशित नहीं हुई है',
    desc: 'जब पाइपलाइन प्रकाशित नहीं होती है, तो आप ज्ञान बेस नोड में हिस्सा संरचना को संशोधित कर सकते हैं, और पाइपलाइन संचालन और परिवर्तनों को स्वचालित रूप से मसौदे के रूप में सहेजा जाएगा।',
  },
  result: {
    resultPreview: {
      viewDetails: 'विवरण देखें',
      error: 'कार्यवाही के दौरान त्रुटि हुई',
      loading: 'प्रसंस्करण हो रहा है... कृपया प्रतीक्षा करें',
    },
  },
  ragToolSuggestions: {
    title: 'आरएजी के लिए सुझाव',
  },
}

export default translation
