{
  "currentSigned": "SAAT INI MASUK SEBAGAI",
  "emailLabel": "Email Anda saat ini",
  "form.schoolName.placeholder": "Masukkan nama resmi sekolah Anda yang tidak disingkat",
  "form.schoolName.title": "Nama Sekolah Anda",
  "form.schoolRole.option.administrator": "Administrator Sekolah",
  "form.schoolRole.option.student": "Pelajar",
  "form.schoolRole.option.teacher": "Guru",
  "form.schoolRole.title": "Peran Sekolah Anda",
  "form.terms.desc.and": "dan",
  "form.terms.desc.end": ". Dengan mengirimkan:",
  "form.terms.desc.front": "Informasi Anda dan penggunaan status Education Verified tunduk pada",
  "form.terms.desc.privacyPolicy": "Kebijakan Privasi",
  "form.terms.desc.termsOfService": "Ketentuan Layanan",
  "form.terms.option.age": "Saya mengonfirmasi bahwa saya berusia setidaknya 18 tahun",
  "form.terms.option.inSchool": "Saya mengonfirmasi bahwa saya terdaftar atau dipekerjakan di lembaga yang disediakan. Dify dapat meminta bukti pendaftaran/pekerjaan. Jika saya salah menggambarkan kelayakan saya, saya setuju untuk membayar biaya apa pun yang awalnya dibebaskan berdasarkan status pendidikan saya.",
  "form.terms.title": "Syarat & Perjanjian",
  "learn": "Pelajari cara mendapatkan verifikasi pendidikan",
  "notice.action.dismiss": "Mengabaikan",
  "notice.action.reVerify": "Verifikasi ulang",
  "notice.action.upgrade": "Upgrade",
  "notice.alreadyGraduated.expired": "Jangan ragu untuk meningkatkan kapan saja untuk mendapatkan akses penuh ke fitur berbayar.",
  "notice.alreadyGraduated.isAboutToExpire": "Langganan Anda saat ini akan tetap aktif. Setelah berakhir, Anda akan dipindahkan ke paket Sandbox, atau Anda dapat meningkatkan kapan saja untuk memulihkan akses penuh ke fitur berbayar.",
  "notice.alreadyGraduated.title": "Sudah lulus?",
  "notice.dateFormat": "MM / DD / YYYY",
  "notice.expired.summary.line1": "Anda masih dapat mengakses dan menggunakan Dify.",
  "notice.expired.summary.line2": "Namun, Anda tidak lagi memenuhi syarat untuk kupon diskon pendidikan baru.",
  "notice.expired.title": "Status pendidikan Anda telah kedaluwarsa",
  "notice.isAboutToExpire.summary": "Jangan khawatir — ini tidak akan memengaruhi langganan Anda saat ini, tetapi Anda tidak akan mendapatkan diskon pendidikan saat diperpanjang kecuali Anda memverifikasi status Anda lagi.",
  "notice.isAboutToExpire.title": "Status pendidikan Anda akan berakhir pada {{date}}",
  "notice.stillInEducation.expired": "Verifikasi ulang sekarang untuk mendapatkan kupon baru untuk tahun akademik mendatang. Kami akan menambahkannya ke akun Anda dan Anda dapat menggunakannya untuk peningkatan berikutnya.",
  "notice.stillInEducation.isAboutToExpire": "Verifikasi ulang sekarang untuk mendapatkan kupon baru untuk tahun akademik mendatang. Ini akan disimpan ke akun Anda dan siap digunakan pada perpanjangan berikutnya.",
  "notice.stillInEducation.title": "Masih dalam pendidikan?",
  "rejectContent": "Sayangnya, Anda tidak memenuhi syarat untuk status Education Verified dan oleh karena itu tidak dapat menerima kupon 100% eksklusif untuk Paket Dify Professional jika Anda menggunakan alamat email ini.",
  "rejectTitle": "Verifikasi Pendidikan Dify Anda telah ditolak",
  "submit": "Kirim",
  "submitError": "Pengiriman formulir gagal. Silakan coba lagi nanti.",
  "successContent": "Kami telah mengeluarkan kupon diskon 100% untuk paket Dify Professional ke akun Anda. Kupon berlaku selama satu tahun, harap gunakan dalam masa berlaku.",
  "successTitle": "Anda telah mendapatkan Dify Education Verified",
  "toVerified": "Dapatkan Pendidikan Terverifikasi",
  "toVerifiedTip.coupon": "kupon eksklusif 100%",
  "toVerifiedTip.end": "untuk Paket Profesional Dify.",
  "toVerifiedTip.front": "Anda sekarang memenuhi syarat untuk status Terverifikasi Pendidikan. Silakan masukkan informasi pendidikan Anda di bawah ini untuk menyelesaikan proses dan menerima"
}
