const translation = {
  creation: {
    createFromScratch: {
      title: 'Пустой конвейер знаний',
      description: 'Создайте кастомный конвейер с нуля с полным контролем над обработкой и структурой данных.',
    },
    importDSL: 'Импорт из файла DSL',
    caution: 'Осторожность',
    backToKnowledge: 'Назад к знаниям',
    createKnowledge: 'Создание знаний',
    successTip: 'Успешно создали базу знаний',
    errorTip: 'Не удалось создать базу знаний',
  },
  templates: {
    customized: 'Настроить',
  },
  operations: {
    choose: 'Выбирать',
    process: 'Процесс',
    details: 'Подробности',
    dataSource: 'Источник данных',
    preview: 'Предварительный просмотр',
    saveAndProcess: 'Сохранение и переработка',
    backToDataSource: 'Вернуться к источнику данных',
    editInfo: 'Редактировать информацию',
    useTemplate: 'Использование этого конвейера знаний',
    convert: 'Обращать',
    exportPipeline: 'Экспортный конвейер',
  },
  deletePipeline: {
    title: 'Вы уверены, что удалите этот шаблон воронки продаж?',
    content: 'Удаление шаблона конвейера является необратимым.',
  },
  publishPipeline: {
    success: {
      message: 'Опубликован конвейер знаний',
    },
    error: {
      message: 'Не удалось опубликовать конвейер знаний',
    },
  },
  publishTemplate: {
    success: {
      learnMore: 'Подробнее',
      message: 'Опубликован шаблон конвейера',
      tip: 'Вы можете использовать этот шаблон на странице создания.',
    },
    error: {
      message: 'Не удалось опубликовать шаблон конвейера',
    },
  },
  exportDSL: {
    successTip: 'Экспорт конвейера DSL успешно',
    errorTip: 'Не удалось экспортировать DSL конвейера',
  },
  details: {
    structure: 'Структура',
    structureTooltip: 'Структура блоков определяет порядок разделения и индексирования документов (в соответствии с режимами «Общие», «Родитель-потомок» и «Вопросы и ответы») и является уникальной для каждой базы знаний.',
  },
  testRun: {
    steps: {
      dataSource: 'Источник данных',
      documentProcessing: 'Обработка документов',
    },
    dataSource: {
      localFiles: 'Локальные файлы',
    },
    notion: {
      docTitle: 'Документация по Notion',
      title: 'Выберите страницы Notion',
    },
    title: 'Тестовый прогон',
    tooltip: 'В режиме тестового прогона одновременно разрешается импортировать только один документ для упрощения отладки и наблюдения.',
  },
  inputFieldPanel: {
    uniqueInputs: {
      title: 'Уникальные входы для каждого входа',
      tooltip: 'Уникальные входные данные доступны только выбранному источнику данных и его нижестоящим узлам. Пользователям не нужно будет заполнять его при выборе других источников данных. На первом шаге (Data Source) будут отображаться только поля ввода, на которые ссылаются переменные источника данных. Все остальные поля будут показаны на втором шаге (Process Documents).',
    },
    globalInputs: {
      title: 'Глобальные входы для всех входов',
      tooltip: 'Глобальные входные данные являются общими для всех узлов. Пользователям потребуется ввести их при выборе любого источника данных. Например, такие поля, как разделитель и максимальная длина блока, могут быть единообразно применены к нескольким источникам данных. На первом шаге отображаются только поля ввода, на которые ссылаются переменные источника данных (Data Source). Все остальные поля отображаются на втором шаге (Process Documents).',
    },
    preview: {
      stepOneTitle: 'Источник данных',
      stepTwoTitle: 'Документы по процессу',
    },
    error: {
      variableDuplicate: 'Имя переменной уже существует. Пожалуйста, выберите другое название.',
    },
    addInputField: 'Добавить поле ввода',
    editInputField: 'Редактировать поле ввода',
    title: 'Поля ввода данных пользователем',
    description: 'Поля ввода данных пользователем используются для определения и сбора переменных, необходимых в процессе выполнения конвейера. Пользователи могут настраивать тип поля и гибко настраивать входное значение в соответствии с потребностями различных источников данных или этапов обработки документов.',
  },
  addDocuments: {
    steps: {
      processDocuments: 'Документы по процессу',
      chooseDatasource: 'Выбор источника данных',
      processingDocuments: 'Обработка документов',
    },
    stepOne: {
      preview: 'Предварительный просмотр',
    },
    stepTwo: {
      chunkSettings: 'Настройки чанка',
      previewChunks: 'Предварительный просмотр чанков',
    },
    stepThree: {
      learnMore: 'Подробнее',
    },
    characters: 'письмена',
    backToDataSource: 'Источник данных',
    title: 'Добавить документы',
  },
  documentSettings: {
    title: 'Настройки документа',
  },
  onlineDocument: {},
  onlineDrive: {
    breadcrumbs: {
      allFiles: 'Все файлы',
      searchPlaceholder: 'Поиск файлов...',
      allBuckets: 'Все корзины облачного хранилища',
    },
    resetKeywords: 'Сброс ключевых слов',
    emptyFolder: 'Эта папка пуста',
    emptySearchResult: 'Предметы не найдены',
    notSupportedFileType: 'Этот тип файлов не поддерживается',
  },
  credentialSelector: {},
  conversion: {
    confirm: {
      title: 'Подтверждение',
      content: 'Это действие является постоянным. Вы не сможете вернуться к предыдущему методу. Пожалуйста, подтвердите конвертацию.',
    },
    title: 'Конвертация в конвейер знаний',
    warning: 'Это действие нельзя отменить.',
    errorMessage: 'Не удалось преобразовать набор данных в конвейер',
    successMessage: 'Успешное преобразование набора данных в конвейер',
    descriptionChunk2: '— более открытый и гибкий подход с доступом к плагинам из нашего маркетплейса. Это позволит применить новый метод обработки ко всем будущим документам.',
    descriptionChunk1: 'Теперь вы можете преобразовать существующую базу знаний для использования конвейера знаний для обработки документов',
  },
  knowledgeDescription: 'Описание знаний',
  inputField: 'Поле ввода',
  knowledgePermissions: 'Разрешения',
  pipelineNameAndIcon: 'Имя и иконка конвейера',
  knowledgeNameAndIcon: 'Имя и значок базы знаний',
  knowledgeNameAndIconPlaceholder: 'Пожалуйста, введите название базы знаний',
  editPipelineInfo: 'Редактирование сведений о воронке продаж',
  knowledgeDescriptionPlaceholder: 'Опишите, что входит в эту базу знаний. Подробное описание позволяет ИИ более точно получать доступ к содержимому набора данных. Если значение пусто, Dify будет использовать стратегию попадания по умолчанию. (Дополнительный)',
}

export default translation
