{
  "currentSigned": "В ДАННЫЙ МОМЕНТ ВХОД В ПРОФИЛЬ КАК",
  "emailLabel": "Ваш текущий адрес электронной почты",
  "form.schoolName.placeholder": "Введите официальное, полное название вашей школы",
  "form.schoolName.title": "Название вашей школы",
  "form.schoolRole.option.administrator": "Школьный администратор",
  "form.schoolRole.option.student": "Студент",
  "form.schoolRole.option.teacher": "Учитель",
  "form.schoolRole.title": "Ваша школьная роль",
  "form.terms.desc.and": "и",
  "form.terms.desc.end": ". Отправляя:",
  "form.terms.desc.front": "Ваша информация и использование статуса Проверенное образование подлежат нашим",
  "form.terms.desc.privacyPolicy": "Политика конфиденциальности",
  "form.terms.desc.termsOfService": "Условия обслуживания",
  "form.terms.option.age": "Я подтверждаю, что мне не меньше 18 лет",
  "form.terms.option.inSchool": "Я подтверждаю, что я зачислен или работаю в указанной учреждении. Dify может запросить подтверждение зачисления/трудоустройства. Если я неправильно укажу свою правообладанность, я согласен оплатить любые сборы, которые изначально были отменены на основании моего образовательного статуса.",
  "form.terms.title": "Условия и соглашения",
  "learn": "Узнайте, как получить подтверждение образования",
  "notice.action.dismiss": "Отклонить",
  "notice.action.reVerify": "Перепроверить",
  "notice.action.upgrade": "Обновление",
  "notice.alreadyGraduated.expired": "Не стесняйтесь обновить подписку в любое время, чтобы получить полный доступ к платным функциям.",
  "notice.alreadyGraduated.isAboutToExpire": "Ваша текущая подписка останется активной. Когда она закончится, вы перейдете на план Sandbox, или вы можете в любое время обновить подписку, чтобы восстановить полный доступ к платным функциям.",
  "notice.alreadyGraduated.title": "Уже окончили?",
  "notice.dateFormat": "ДД/ММ/ГГГГ",
  "notice.expired.summary.line1": "Вы все еще можете получить доступ к Dify и использовать его.",
  "notice.expired.summary.line2": "Однако вы больше не имеете права на новые купоны на скидку на образование.",
  "notice.expired.title": "Ваш статус образования истек",
  "notice.isAboutToExpire.summary": "Не волнуйся — это не повлияет на твою текущую подписку, но ты не получишь образовательную скидку при её продлении, если не подтвердишь свой статус снова.",
  "notice.isAboutToExpire.title": "Статус вашего образования истечет {{date}}",
  "notice.stillInEducation.expired": "Переутвердите сейчас, чтобы получить новый купон на предстоящий учебный год. Мы добавим его на ваш аккаунт, и вы сможете использовать его для следующего обновления.",
  "notice.stillInEducation.isAboutToExpire": "Проверьте еще раз, чтобы получить новый купон на предстоящий учебный год. Он будет сохранен в вашем аккаунте и готов к использованию при следующем продлении.",
  "notice.stillInEducation.title": "Все еще учишься?",
  "rejectContent": "К сожалению, вы не имеете права на статус Проверенного образованием и, следовательно, не можете получить эксклюзивный купон на 100% для профессионального плана Dify, если вы используете этот адрес электронной почты.",
  "rejectTitle": "Ваша образовательная проверка Dify была отклонена",
  "submit": "Отправить",
  "submitError": "Отправка формы не удалась. Пожалуйста, попробуйте позже.",
  "successContent": "Мы выдали купон на 100% скидку на план Dify Professional для вашего аккаунта. Купон действителен в течение одного года, пожалуйста, используйте его в течение срока действия.",
  "successTitle": "Вы получили подтвержденное образование Dify",
  "toVerified": "Получите подтверждение образования",
  "toVerifiedTip.coupon": "эксклюзивный 100% купон",
  "toVerifiedTip.end": "для профессионального плана Dify.",
  "toVerifiedTip.front": "Теперь вы имеете право на статус \"Проверенное образование\". Пожалуйста, введите свои образовательные данные ниже, чтобы завершить процесс и получить"
}
