const translation = {
  tips: {
    needLogin: 'Пожалуйста, войдите, чтобы авторизоваться',
    notLoggedIn: 'Это приложение хочет получить доступ к вашей учетной записи Dify Cloud',
    loggedIn: 'Это приложение хочет получить следующую информацию из вашего аккаунта Dify Cloud.',
    common: 'Мы уважаем вашу конфиденциальность и будем использовать эту информацию только для улучшения вашего опыта с нашими инструментами разработчика.',
  },
  scopes: {
    languagePreference: 'Предпочтение языка',
    email: 'Электронная почта',
    avatar: 'Аватар',
    name: 'Имя',
    timezone: 'Часовой пояс',
  },
  error: {
    invalidParams: 'Неверные параметры',
    authorizeFailed: 'Авторизация не удалась',
    authAppInfoFetchFailed: 'Не удалось получить информацию об приложении для авторизации',
  },
  continue: 'Продолжить',
  connect: 'Подключиться к',
  switchAccount: 'Сменить аккаунт',
  unknownApp: 'Неизвестное приложение',
  login: 'Вход',
}

export default translation
