const translation = {
  common: {
    publishAsPipeline: {
      description: 'Описание знаний',
      name: 'Имя и иконка конвейера',
      namePlaceholder: 'Пожалуйста, введите имя этого конвейера знаний. (Обязательно)',
      descriptionPlaceholder: 'Пожалуйста, введите описание этого конвейера знаний. (Дополнительный)',
    },
    processing: 'Обработка',
    reRun: 'Повторный запуск',
    testRun: 'Тестовый прогон',
    preparingDataSource: 'Подготовка источника данных',
    confirmPublish: 'Подтвердите публикацию',
    goToAddDocuments: 'Перейти к добавлению документов',
    publishAs: 'Публикация в качестве конвейера знаний',
    confirmPublishContent: 'После успешной публикации конвейера знаний структура блоков этой базы знаний не может быть изменена. Вы уверены, что хотите его опубликовать?',
  },
  inputField: {
    manage: 'Руководить',
    create: 'Создание поля ввода данных пользователем',
  },
  publishToast: {
    title: 'Этот пайплайн еще не опубликован',
    desc: 'Если конвейер не опубликован, вы можете изменить структуру блоков в узле базы знаний, а оркестрация конвейера и изменения будут автоматически сохранены в виде черновика.',
  },
  result: {
    resultPreview: {
      viewDetails: 'Подробнее',
      loading: 'Обработка... Подождите',
      error: 'Ошибка произошла во время выполнения',
    },
  },
  ragToolSuggestions: {
    title: 'Предложения по КГР',
  },
}

export default translation
