{
  "currentSigned": "ACTUALMENTE CONECTADO COMO",
  "emailLabel": "Tu correo electrónico actual",
  "form.schoolName.placeholder": "Ingrese el nombre oficial y completo de su escuela",
  "form.schoolName.title": "El nombre de tu escuela",
  "form.schoolRole.option.administrator": "Administrador escolar",
  "form.schoolRole.option.student": "Estudiante",
  "form.schoolRole.option.teacher": "Profesor",
  "form.schoolRole.title": "Tu rol en la escuela",
  "form.terms.desc.and": "y",
  "form.terms.desc.end": ". Al enviar:",
  "form.terms.desc.front": "Su información y uso del estado de Educación Verificada están sujetos a nuestra",
  "form.terms.desc.privacyPolicy": "Política de privacidad",
  "form.terms.desc.termsOfService": "Términos de Servicio",
  "form.terms.option.age": "Confirmo que tengo al menos 18 años",
  "form.terms.option.inSchool": "Confirmo que estoy inscrito o empleado en la institución indicada. Dify puede solicitar prueba de inscripción/empleo. Si falseo mi elegibilidad, acepto pagar cualquier tarifa que se haya eximido inicialmente en función de mi estado educativo.",
  "form.terms.title": "Términos y Acuerdos",
  "learn": "Aprende cómo obtener la verificación de la educación",
  "notice.action.dismiss": "Descartar",
  "notice.action.reVerify": "Re-verificar",
  "notice.action.upgrade": "Actualizar",
  "notice.alreadyGraduated.expired": "Siéntete libre de actualizar en cualquier momento para obtener acceso completo a las funciones de pago.",
  "notice.alreadyGraduated.isAboutToExpire": "Tu suscripción actual seguirá activa. Cuando termine, serás trasladado al plan Sandbox, o puedes actualizar en cualquier momento para restaurar el acceso completo a las funciones de pago.",
  "notice.alreadyGraduated.title": "¿Ya te has graduado?",
  "notice.dateFormat": "DD/MM/YYYY",
  "notice.expired.summary.line1": "Todavía puedes acceder y usar Dify.",
  "notice.expired.summary.line2": "Sin embargo, ya no eres elegible para nuevos cupones de descuento educativo.",
  "notice.expired.title": "Tu estado de educación ha expirado",
  "notice.isAboutToExpire.summary": "No te preocupes, esto no afectará tu suscripción actual, pero no obtendrás el descuento educativo cuando se renueve a menos que verifiques tu estado nuevamente.",
  "notice.isAboutToExpire.title": "Tu estado educativo expirará el {{date}}",
  "notice.stillInEducation.expired": "Verifica de nuevo ahora para obtener un nuevo cupón para el próximo año académico. Lo añadiremos a tu cuenta y podrás usarlo para la próxima actualización.",
  "notice.stillInEducation.isAboutToExpire": "Verifica de nuevo ahora para obtener un nuevo cupón para el próximo año académico. Se guardará en tu cuenta y estará listo para usar en tu próxima renovación.",
  "notice.stillInEducation.title": "¿Aún en educación?",
  "rejectContent": "Desafortunadamente, no eres elegible para el estado de Educación Verificada y, por lo tanto, no puedes recibir el exclusivo cupón del 100% para el Plan Profesional de Dify si utilizas esta dirección de correo electrónico.",
  "rejectTitle": "Su verificación educativa de Dify ha sido rechazada.",
  "submit": "Enviar",
  "submitError": "Error en el envío del formulario. Por favor, inténtelo de nuevo más tarde.",
  "successContent": "Hemos emitido un cupón de descuento del 100% para el plan Dify Professional en tu cuenta. El cupón es válido por un año, por favor utilízalo dentro del período de validez.",
  "successTitle": "Tienes la educación Dify verificada",
  "toVerified": "Verifica la educación",
  "toVerifiedTip.coupon": "cupón exclusivo del 100%",
  "toVerifiedTip.end": "para el Plan Profesional de Dify.",
  "toVerifiedTip.front": "Ahora eres elegible para el estado de Educación Verificada. Por favor, introduce tu información educativa a continuación para completar el proceso y recibir un"
}
