{
  "!": 0,
  "!!": 3228,
  "!!!": 10185,
  "!!!!": 13896,
  "!!!!!": 50184,
  "!!!!!!!!": 34635,
  "!!\"": 37160,
  "!\"": 2474,
  "!\",": 40754,
  "!\".": 48220,
  "!'": 13679,
  "!'\"": 49296,
  "!)": 8133,
  "!),": 26290,
  "!).": 19588,
  "!,": 28265,
  "!--": 28112,
  "!.": 43179,
  "!/": 48443,
  "!:": 48725,
  "!?": 22857,
  "!?\"": 42720,
  "!]": 36463,
  "\"": 1,
  "\"!": 40484,
  "\"\"": 15931,
  "\"\"\"": 37811,
  "\"'": 30543,
  "\"(": 18109,
  "\")": 4943,
  "\"))": 48774,
  "\"),": 12340,
  "\").": 11074,
  "\");": 15341,
  "\",": 1600,
  "\",\"": 2430,
  "\"-": 26793,
  "\".": 1911,
  "\"...": 26214,
  "\".[": 42924,
  "\"/>": 26700,
  "\":": 1298,
  "\":\"": 2404,
  "\":\"\",\"": 34713,
  "\":\"\"},{\"": 47182,
  "\":\"/": 15473,
  "\":-": 48219,
  "\":[": 20598,
  "\":[\"": 26358,
  "\":[{\"": 32509,
  "\":{\"": 8351,
  "\";": 8172,
  "\">": 5320,
  "\"><": 22039,
  "\"></": 23984,
  "\"?": 13984,
  "\"[": 17912,
  "\"]": 8973,
  "\"],": 33116,
  "\"],\"": 34171,
  "\"]=>": 23785,
  "\"}": 20662,
  "\"},": 25719,
  "\"},\"": 13018,
  "\"},{\"": 11919,
  "\"}],\"": 42785,
  "\"âĢ¦": 24426,
  "\"âĢĶ": 15327,
  "#": 2,
  "##": 2235,
  "###": 21017,
  "####": 4242,
  "########": 7804,
  "################": 14468,
  "################################": 29113,
  "#$": 29953,
  "#$#$": 34206,
  "$": 3,
  "$$": 13702,
  "$$$$": 36737,
  "$,": 47113,
  "$.": 35307,
  "${": 38892,
  "%": 4,
  "%\"": 39658,
  "%%": 16626,
  "%%%%": 36917,
  "%)": 4407,
  "%),": 15920,
  "%).": 18823,
  "%);": 49563,
  "%,": 7441,
  "%-": 33963,
  "%.": 7225,
  "%:": 48529,
  "%;": 26525,
  "%]": 39850,
  "&": 5,
  "&&": 25226,
  "'": 6,
  "'\"": 29653,
  "''": 7061,
  "''''": 39115,
  "''.": 35384,
  "'';": 44648,
  "')": 11537,
  "'),": 33809,
  "').": 27691,
  "');": 24036,
  "',": 3256,
  "',\"": 40264,
  "','": 41707,
  "'-": 29001,
  "'.": 4458,
  "'.\"": 30827,
  "'/": 26488,
  "':": 10354,
  "';": 17020,
  "'>": 44167,
  "'?": 30960,
  "']": 20520,
  "'d": 1549,
  "'ll": 1183,
  "'m": 1101,
  "'re": 821,
  "'s": 338,
  "'t": 470,
  "'ve": 1053,
  "(": 7,
  "(\"": 7203,
  "($": 16763,
  "(&": 39434,
  "('": 10786,
  "((": 19510,
  "()": 3419,
  "())": 28955,
  "());": 35430,
  "(),": 22784,
  "().": 22446,
  "():": 33529,
  "();": 9783,
  "(){": 39893,
  "(*": 46491,
  "(-": 32590,
  "([": 26933,
  "(\\": 38016,
  "(_": 28264,
  "({": 15090,
  ")": 8,
  ")!": 31520,
  ")\"": 16725,
  ")\",": 42501,
  ")'": 33047,
  ")(": 5769,
  "))": 4008,
  ")))": 22305,
  "))))": 35514,
  ")),": 36911,
  ")).": 29720,
  "));": 18125,
  ")*": 27493,
  ")+": 47762,
  "),": 828,
  "),\"": 27267,
  ")-": 13219,
  ")--": 42944,
  ").": 737,
  ").\"": 21387,
  ")...": 26513,
  ").[": 42669,
  ")/": 20679,
  "):": 2599,
  ");": 1776,
  ")</": 36475,
  ")=": 47505,
  ")=(": 35793,
  ")?": 19427,
  ")[": 38381,
  ")\\": 19415,
  ")]": 15437,
  ")].": 25295,
  "){": 19953,
  ")|": 14726,
  ")}": 38165,
  ")âĢĶ": 27920,
  "*": 9,
  "*)": 28104,
  "**": 1174,
  "***": 8162,
  "****": 2466,
  "*****": 35625,
  "********": 4557,
  "************": 46068,
  "****************": 8412,
  "********************************": 17174,
  "*,": 25666,
  "*.": 24620,
  "*/": 16208,
  "*/(": 40278,
  "*:": 47026,
  "*=-": 48069,
  "+": 10,
  "+(": 33747,
  "+)": 28988,
  "++": 4880,
  "++)": 29577,
  "+++": 45340,
  "++++": 14030,
  "++++++++": 25128,
  "++++++++++++++++": 44627,
  "++;": 47253,
  "+,": 28200,
  "+.": 27613,
  "+=": 47932,
  ",": 11,
  ",\"": 553,
  ",'": 4032,
  ",'\"": 16078,
  ",''": 14004,
  ",)": 35751,
  ",,": 9832,
  ",,,,": 23846,
  ",,,,,,,,": 47682,
  ",-": 12095,
  ",.": 38508,
  ",...": 42303,
  ",[": 17414,
  ",âĢĶ": 34976,
  "-": 12,
  "-\"": 21215,
  "-$": 22799,
  "-'": 19355,
  "-(": 30420,
  "-)": 25106,
  "-+": 19529,
  "-+-+": 27097,
  "-+-+-+-+": 42744,
  "-,": 20995,
  "--": 438,
  "--+": 44785,
  "---": 6329,
  "----": 650,
  "-----": 30934,
  "------": 23031,
  "-------": 26866,
  "--------": 982,
  "---------": 45537,
  "----------": 35937,
  "-----------": 32284,
  "------------": 10541,
  "-------------": 32501,
  "--------------": 26171,
  "---------------": 24305,
  "----------------": 1783,
  "--------------------": 19351,
  "------------------------": 22369,
  "--------------------------------": 3880,
  "------------------------------------------------": 47232,
  "--------------------------------------------------------": 43801,
  "----------------------------------------------------------------": 10097,
  "-->": 46904,
  "-.": 34507,
  "->": 3784,
  "-[": 49146,
  "-|": 22831,
  ".": 13,
  ".\"": 526,
  ".\"\"": 32203,
  ".\")": 19570,
  ".\",": 33283,
  ".\",\"": 41424,
  ".\"[": 18161,
  ".#": 32535,
  ".$": 48082,
  ".'": 2637,
  ".'\"": 11496,
  ".''": 13531,
  ".''.": 50113,
  ".(": 12195,
  ".)": 2014,
  ".),": 12179,
  ".).": 15729,
  ".):": 47308,
  ".*": 15885,
  ".,": 1539,
  ".,\"": 44388,
  ".-": 7874,
  ".--": 9816,
  "..": 492,
  "...": 986,
  "...\"": 9313,
  "...)": 23029,
  "....": 1106,
  ".....": 12359,
  "......": 16317,
  ".......": 25780,
  "........": 2109,
  ".........": 34617,
  ".............": 44274,
  "................": 4181,
  "..................": 49129,
  "........................": 27754,
  "................................": 8864,
  "................................................................": 23193,
  "...?": 44825,
  "...]": 22345,
  "../": 40720,
  "./": 19571,
  ".:": 11207,
  ".;": 15089,
  ".<": 29847,
  ".</": 25970,
  ".>>": 32756,
  ".?": 40791,
  ".[": 3693,
  ".]": 8183,
  "._": 13557,
  ".}": 44587,
  ".âĢĵ": 37585,
  ".âĢĶ": 13402,
  ".ãĢį": 43735,
  ".ï¿½": 40670,
  "/": 14,
  "/\"": 30487,
  "/#": 31113,
  "/$": 32624,
  "/(": 29006,
  "/)": 34729,
  "/*": 15211,
  "/**": 35343,
  "/+": 28404,
  "/,": 47454,
  "/-": 16327,
  "/.": 11757,
  "//": 1003,
  "///": 20379,
  "////": 9705,
  "////////": 16150,
  "////////////////": 27246,
  "////////////////////////////////": 49704,
  "/>": 15913,
  "/?": 20924,
  "/_": 47835,
  "/âĢĭ": 27643,
  "0": 15,
  "00": 405,
  "000": 830,
  "0000": 2388,
  "00000": 20483,
  "000000": 10535,
  "0000000": 24598,
  "00000000": 8269,
  "0000000000000000": 25645,
  "00007": 44808,
  "0001": 18005,
  "0002": 34215,
  "001": 8298,
  "0010": 37187,
  "002": 21601,
  "00200000": 36490,
  "003": 11245,
  "004": 22914,
  "005": 22544,
  "006": 28041,
  "007": 25816,
  "008": 25257,
  "009": 28694,
  "01": 486,
  "010": 20943,
  "0100": 39103,
  "011": 28555,
  "012": 30206,
  "013": 30273,
  "014": 28645,
  "015": 25150,
  "016": 27037,
  "017": 29326,
  "018": 29159,
  "019": 30484,
  "02": 2999,
  "020": 33618,
  "0200": 44613,
  "021": 46821,
  "022": 44087,
  "023": 45310,
  "024": 40839,
  "025": 36629,
  "026": 45987,
  "027": 44698,
  "028": 46957,
  "029": 48891,
  "03": 3070,
  "030": 39101,
  "031": 43637,
  "032": 49959,
  "033": 44427,
  "034": 49841,
  "035": 44215,
  "036": 48597,
  "04": 3023,
  "040": 36676,
  "041": 50049,
  "043": 48768,
  "044": 43977,
  "045": 40350,
  "046": 45438,
  "047": 48000,
  "048": 47202,
  "05": 2713,
  "050": 28669,
  "052": 37841,
  "055": 47838,
  "057": 43526,
  "059": 46712,
  "06": 3312,
  "060": 41322,
  "07": 2998,
  "070": 43509,
  "075": 46396,
  "08": 2919,
  "080": 33057,
  "083": 48290,
  "088": 46556,
  "089": 49352,
  "09": 2931,
  "090": 42534,
  "1": 16,
  "10": 940,
  "100": 3064,
  "1000": 12825,
  "10000": 49388,
  "1001": 47705,
  "1007": 44318,
  "101": 8784,
  "1016": 27956,
  "102": 15377,
  "1024": 35500,
  "1027": 40403,
  "103": 15197,
  "104": 13464,
  "105": 13348,
  "106": 15801,
  "107": 15982,
  "108": 15711,
  "1080": 24045,
  "109": 14454,
  "11": 1157,
  "110": 11442,
  "1100": 42060,
  "111": 16243,
  "1111": 26259,
  "112": 14686,
  "113": 16616,
  "114": 16562,
  "115": 15363,
  "116": 18298,
  "117": 17657,
  "118": 16817,
  "119": 16315,
  "12": 1065,
  "120": 10232,
  "1200": 27550,
  "121": 19244,
  "122": 18376,
  "123": 10163,
  "124": 17464,
  "125": 11623,
  "126": 19420,
  "127": 16799,
  "128": 12762,
  "129": 18741,
  "13": 1485,
  "130": 12952,
  "131": 22042,
  "132": 19924,
  "133": 16945,
  "134": 19880,
  "135": 17059,
  "136": 20809,
  "137": 19708,
  "138": 20107,
  "139": 20219,
  "14": 1415,
  "140": 15187,
  "141": 23756,
  "142": 23726,
  "143": 21139,
  "144": 18444,
  "145": 18781,
  "146": 20964,
  "147": 20198,
  "148": 18294,
  "149": 19442,
  "15": 1314,
  "150": 8628,
  "1500": 33698,
  "151": 24309,
  "152": 17827,
  "153": 21395,
  "154": 21526,
  "155": 18742,
  "156": 21599,
  "157": 18458,
  "158": 21273,
  "159": 19707,
  "16": 1433,
  "160": 14198,
  "1600": 36150,
  "161": 25948,
  "162": 25061,
  "163": 24136,
  "164": 23237,
  "165": 20986,
  "166": 23055,
  "167": 21940,
  "168": 14656,
  "169": 22172,
  "17": 1558,
  "170": 17279,
  "171": 27192,
  "172": 23628,
  "173": 25399,
  "174": 22985,
  "175": 17430,
  "176": 24096,
  "177": 22413,
  "178": 23188,
  "179": 21738,
  "18": 1507,
  "180": 15259,
  "1800": 39188,
  "181": 27057,
  "182": 24294,
  "183": 24839,
  "184": 22883,
  "185": 21652,
  "186": 25096,
  "187": 23451,
  "188": 20356,
  "189": 23362,
  "19": 1129,
  "190": 19782,
  "1900": 48104,
  "191": 26492,
  "192": 17477,
  "1920": 40454,
  "193": 24943,
  "194": 22913,
  "1945": 41931,
  "195": 22186,
  "1950": 42751,
  "1959": 45403,
  "196": 25272,
  "1960": 38503,
  "1963": 45192,
  "1964": 46477,
  "1965": 45271,
  "1966": 44227,
  "1967": 42830,
  "1968": 42246,
  "1969": 38391,
  "197": 24991,
  "1970": 30986,
  "1971": 41208,
  "1972": 41023,
  "1973": 40220,
  "1974": 40828,
  "1975": 38449,
  "1976": 38108,
  "1977": 37781,
  "1978": 37950,
  "1979": 33581,
  "198": 22337,
  "1980": 23664,
  "1981": 35411,
  "1982": 30763,
  "1983": 29279,
  "1984": 28296,
  "1985": 29110,
  "1986": 28054,
  "1987": 27301,
  "1988": 26709,
  "1989": 25475,
  "199": 19104,
  "1990": 19891,
  "1991": 24529,
  "1992": 23847,
  "1993": 24465,
  "1994": 22666,
  "1995": 21908,
  "1996": 22288,
  "1997": 21498,
  "1998": 21113,
  "1999": 18946,
  "2": 17,
  "20": 1238,
  "200": 2167,
  "2000": 11024,
  "200000": 33470,
  "2001": 14585,
  "2002": 16942,
  "2003": 16088,
  "2004": 15724,
  "2005": 14315,
  "2006": 13330,
  "2007": 12726,
  "2008": 11528,
  "2009": 10531,
  "201": 1264,
  "2010": 10333,
  "2011": 9804,
  "2012": 6999,
  "2013": 6390,
  "2014": 4967,
  "2015": 4626,
  "2016": 5304,
  "2017": 5539,
  "2018": 7908,
  "2019": 23344,
  "202": 19004,
  "2020": 42334,
  "203": 22416,
  "204": 18638,
  "20439": 47936,
  "205": 21261,
  "206": 22136,
  "207": 22745,
  "208": 21315,
  "209": 22567,
  "21": 2481,
  "210": 21536,
  "211": 21895,
  "212": 21777,
  "213": 26427,
  "214": 22291,
  "215": 23349,
  "216": 20666,
  "217": 24591,
  "218": 28727,
  "219": 28896,
  "22": 1828,
  "220": 17572,
  "2200": 34294,
  "221": 26115,
  "222": 23148,
  "223": 22047,
  "224": 24137,
  "225": 18182,
  "226": 24909,
  "227": 24403,
  "228": 23815,
  "229": 23539,
  "23": 1954,
  "230": 19214,
  "231": 25667,
  "232": 24339,
  "233": 25429,
  "234": 24409,
  "235": 22370,
  "236": 24940,
  "237": 24693,
  "238": 23721,
  "239": 23516,
  "24": 1731,
  "240": 16102,
  "241": 28872,
  "242": 27877,
  "243": 26660,
  "244": 25707,
  "245": 22995,
  "246": 26912,
  "247": 23753,
  "248": 23045,
  "249": 21626,
  "25": 1495,
  "250": 9031,
  "2500": 44688,
  "251": 28072,
  "252": 22800,
  "253": 28592,
  "254": 24970,
  "255": 13381,
  "256": 11645,
  "257": 28676,
  "258": 25600,
  "259": 25191,
  "26": 2075,
  "260": 21719,
  "261": 30057,
  "262": 29119,
  "263": 29558,
  "264": 18897,
  "265": 22980,
  "266": 25540,
  "267": 25674,
  "268": 25022,
  "269": 26276,
  "27": 1983,
  "270": 20233,
  "271": 28977,
  "272": 29807,
  "273": 27367,
  "274": 28857,
  "275": 23195,
  "276": 27988,
  "277": 27019,
  "278": 25870,
  "279": 26050,
  "28": 2078,
  "280": 21033,
  "281": 30368,
  "282": 32568,
  "283": 30290,
  "284": 30336,
  "285": 26279,
  "286": 27033,
  "287": 27800,
  "288": 25270,
  "289": 27693,
  "29": 1959,
  "290": 24369,
  "291": 33551,
  "292": 32759,
  "293": 31675,
  "294": 27696,
  "295": 25710,
  "296": 27137,
  "297": 26561,
  "298": 27728,
  "299": 22579,
  "3": 18,
  "30": 1270,
  "300": 6200,
  "3000": 23924,
  "301": 18938,
  "302": 22709,
  "303": 22572,
  "304": 21288,
  "305": 22515,
  "306": 20548,
  "307": 22996,
  "308": 21495,
  "309": 26895,
  "31": 3132,
  "310": 26717,
  "311": 36244,
  "312": 27970,
  "313": 25838,
  "314": 33638,
  "315": 27936,
  "316": 33400,
  "317": 34125,
  "318": 36042,
  "319": 35175,
  "32": 2624,
  "320": 19504,
  "321": 36453,
  "322": 37283,
  "323": 32637,
  "324": 33916,
  "325": 26582,
  "326": 39195,
  "327": 34159,
  "328": 34256,
  "329": 37967,
  "33": 2091,
  "330": 26073,
  "331": 31697,
  "332": 32148,
  "333": 20370,
  "3333": 24840,
  "334": 31380,
  "335": 27326,
  "336": 29211,
  "337": 31496,
  "338": 28460,
  "339": 29626,
  "34": 2682,
  "340": 23601,
  "341": 33660,
  "342": 31575,
  "343": 32118,
  "344": 33535,
  "345": 27712,
  "346": 30557,
  "347": 30995,
  "348": 28978,
  "349": 27371,
  "35": 2327,
  "350": 14877,
  "351": 35273,
  "352": 33394,
  "353": 33319,
  "354": 32182,
  "355": 28567,
  "356": 32066,
  "357": 27277,
  "358": 31128,
  "359": 30743,
  "36": 2623,
  "360": 15277,
  "361": 35195,
  "362": 35667,
  "363": 35447,
  "364": 26780,
  "365": 24760,
  "366": 32459,
  "367": 27824,
  "368": 27412,
  "369": 30803,
  "37": 2718,
  "370": 20167,
  "371": 38056,
  "372": 36720,
  "373": 34770,
  "374": 31020,
  "375": 22318,
  "376": 32128,
  "377": 26514,
  "378": 30695,
  "379": 29088,
  "38": 2548,
  "380": 23734,
  "381": 36626,
  "382": 36243,
  "383": 34741,
  "384": 22842,
  "385": 27203,
  "386": 21734,
  "387": 32220,
  "388": 30460,
  "389": 29769,
  "39": 2670,
  "390": 25964,
  "391": 37710,
  "392": 32321,
  "393": 26007,
  "394": 34626,
  "395": 31010,
  "396": 34107,
  "397": 33372,
  "398": 31952,
  "399": 28771,
  "4": 19,
  "40": 1821,
  "400": 7029,
  "4000": 27559,
  "401": 21844,
  "402": 32531,
  "403": 31552,
  "404": 26429,
  "405": 26598,
  "406": 29703,
  "407": 30120,
  "408": 26200,
  "409": 29416,
  "41": 3901,
  "410": 33289,
  "411": 42224,
  "412": 39226,
  "413": 44103,
  "414": 37309,
  "415": 35038,
  "416": 35218,
  "417": 38547,
  "418": 39667,
  "419": 45068,
  "42": 3682,
  "420": 27211,
  "421": 46636,
  "422": 44361,
  "423": 43356,
  "424": 40090,
  "425": 32114,
  "426": 42780,
  "427": 42363,
  "428": 40173,
  "429": 11785,
  "43": 3559,
  "430": 31794,
  "431": 50080,
  "432": 45331,
  "433": 42117,
  "434": 47101,
  "435": 40064,
  "436": 43690,
  "437": 43284,
  "438": 43704,
  "439": 47106,
  "44": 2598,
  "440": 25644,
  "441": 39710,
  "442": 39506,
  "443": 34938,
  "444": 30272,
  "445": 43489,
  "446": 27260,
  "447": 34825,
  "448": 31115,
  "449": 31911,
  "45": 2231,
  "450": 17885,
  "451": 36330,
  "452": 37730,
  "453": 36625,
  "454": 34229,
  "455": 30505,
  "456": 29228,
  "457": 33032,
  "458": 29334,
  "459": 33459,
  "46": 3510,
  "460": 34716,
  "461": 40652,
  "462": 39997,
  "463": 38380,
  "464": 44578,
  "465": 42018,
  "466": 42199,
  "467": 24669,
  "468": 38472,
  "469": 42947,
  "47": 2857,
  "470": 27790,
  "471": 38339,
  "472": 37856,
  "473": 37804,
  "474": 38652,
  "475": 32576,
  "476": 35435,
  "477": 32883,
  "478": 29059,
  "479": 31714,
  "48": 2780,
  "480": 22148,
  "481": 40271,
  "482": 40149,
  "483": 38783,
  "484": 34137,
  "485": 32642,
  "486": 34251,
  "487": 35133,
  "488": 33646,
  "489": 35890,
  "49": 2920,
  "490": 31503,
  "491": 41289,
  "492": 40256,
  "493": 43134,
  "494": 39449,
  "495": 33781,
  "496": 37747,
  "497": 38073,
  "498": 36260,
  "499": 28324,
  "5": 20,
  "50": 1120,
  "500": 4059,
  "5000": 27641,
  "501": 33548,
  "502": 35126,
  "503": 31938,
  "504": 33580,
  "505": 31654,
  "506": 35638,
  "507": 35378,
  "508": 33042,
  "509": 29022,
  "51": 4349,
  "510": 33690,
  "511": 41647,
  "512": 25836,
  "513": 48645,
  "514": 47396,
  "515": 45969,
  "516": 47493,
  "517": 48170,
  "518": 44085,
  "519": 47785,
  "52": 4309,
  "520": 31211,
  "522": 49542,
  "523": 49803,
  "524": 48057,
  "525": 39088,
  "526": 48531,
  "528": 49351,
  "529": 49721,
  "53": 4310,
  "530": 38612,
  "533": 44994,
  "535": 44465,
  "536": 44468,
  "537": 46096,
  "538": 49561,
  "54": 4051,
  "540": 35005,
  "544": 47576,
  "545": 45326,
  "546": 49489,
  "548": 49934,
  "549": 44966,
  "55": 2816,
  "550": 22730,
  "551": 43697,
  "552": 40427,
  "553": 48096,
  "554": 44218,
  "555": 31046,
  "556": 37864,
  "557": 41948,
  "558": 40486,
  "559": 38605,
  "56": 3980,
  "560": 34135,
  "561": 47915,
  "562": 43918,
  "563": 46572,
  "565": 47372,
  "568": 49211,
  "57": 3553,
  "570": 39254,
  "571": 42875,
  "572": 48724,
  "573": 48638,
  "574": 46900,
  "575": 36189,
  "576": 37452,
  "577": 49447,
  "578": 38907,
  "579": 41734,
  "58": 3365,
  "580": 39322,
  "581": 48630,
  "582": 46044,
  "583": 46239,
  "584": 46352,
  "585": 38905,
  "586": 29796,
  "587": 44617,
  "588": 39118,
  "589": 44169,
  "59": 3270,
  "590": 36993,
  "591": 48952,
  "592": 45839,
  "593": 49051,
  "594": 46438,
  "595": 35124,
  "596": 45734,
  "597": 43239,
  "598": 41292,
  "599": 43452,
  "6": 21,
  "60": 1899,
  "600": 8054,
  "6000": 43434,
  "601": 41706,
  "602": 31418,
  "603": 35642,
  "604": 31916,
  "605": 32417,
  "606": 33206,
  "607": 31980,
  "608": 28688,
  "609": 31751,
  "61": 5333,
  "610": 39132,
  "612": 43610,
  "613": 47512,
  "614": 46841,
  "615": 47007,
  "616": 44214,
  "617": 47941,
  "618": 47448,
  "62": 5237,
  "620": 38850,
  "623": 46872,
  "625": 26704,
  "626": 45191,
  "627": 49856,
  "628": 48200,
  "629": 48602,
  "63": 5066,
  "630": 30005,
  "635": 48250,
  "64": 2414,
  "640": 31102,
  "641": 42759,
  "642": 41290,
  "643": 41813,
  "644": 29173,
  "645": 49259,
  "646": 27720,
  "647": 33981,
  "648": 34287,
  "649": 33300,
  "65": 2996,
  "650": 17544,
  "651": 40639,
  "652": 43193,
  "653": 46435,
  "654": 39111,
  "655": 35916,
  "656": 37466,
  "657": 37680,
  "658": 38431,
  "659": 36445,
  "66": 2791,
  "660": 39885,
  "661": 47159,
  "662": 39380,
  "663": 45791,
  "665": 36879,
  "666": 27310,
  "6666": 19060,
  "66666666": 41977,
  "667": 28933,
  "668": 35809,
  "669": 36657,
  "67": 3134,
  "670": 43798,
  "671": 46250,
  "672": 43864,
  "673": 45758,
  "674": 45385,
  "675": 42444,
  "676": 42548,
  "677": 40179,
  "678": 30924,
  "679": 37601,
  "68": 3104,
  "680": 37397,
  "681": 48564,
  "682": 43950,
  "683": 47521,
  "684": 41580,
  "685": 35978,
  "686": 33808,
  "687": 39925,
  "688": 34427,
  "689": 40523,
  "69": 3388,
  "690": 35844,
  "691": 49541,
  "692": 46589,
  "693": 48528,
  "694": 45214,
  "695": 37381,
  "696": 38205,
  "697": 40035,
  "698": 39357,
  "699": 47325,
  "7": 22,
  "70": 2154,
  "700": 9879,
  "701": 41583,
  "702": 36680,
  "703": 36809,
  "704": 32869,
  "705": 34801,
  "706": 35402,
  "707": 24038,
  "70710": 42877,
  "708": 32583,
  "709": 31495,
  "71": 4869,
  "710": 43147,
  "712": 49517,
  "713": 50055,
  "714": 45722,
  "718": 45720,
  "72": 4761,
  "720": 23906,
  "725": 45151,
  "727": 47760,
  "728": 48524,
  "729": 48555,
  "73": 4790,
  "730": 43916,
  "733": 49995,
  "736": 49150,
  "74": 4524,
  "740": 45598,
  "745": 50150,
  "747": 48882,
  "748": 48246,
  "75": 2425,
  "750": 15426,
  "751": 48365,
  "752": 43665,
  "753": 44550,
  "754": 41874,
  "755": 38172,
  "756": 38219,
  "757": 39251,
  "758": 38569,
  "759": 38314,
  "76": 4304,
  "760": 40761,
  "7601": 42752,
  "762": 48194,
  "763": 49641,
  "765": 29143,
  "76561": 48527,
  "767": 32059,
  "768": 30610,
  "77": 3324,
  "770": 41820,
  "771": 46761,
  "772": 43571,
  "773": 46871,
  "774": 47582,
  "775": 34483,
  "776": 39509,
  "777": 29331,
  "778": 39761,
  "779": 40393,
  "78": 3695,
  "780": 40873,
  "781": 49703,
  "782": 46519,
  "783": 50165,
  "784": 37688,
  "785": 41172,
  "786": 46302,
  "787": 41019,
  "789": 40401,
  "79": 3720,
  "790": 37750,
  "792": 48156,
  "793": 44750,
  "794": 50242,
  "795": 41544,
  "796": 41060,
  "797": 44673,
  "798": 43240,
  "799": 45455,
  "8": 23,
  "80": 1795,
  "800": 7410,
  "8000": 33942,
  "801": 41531,
  "802": 30863,
  "803": 43564,
  "804": 36088,
  "805": 28256,
  "806": 37988,
  "807": 36928,
  "808": 28362,
  "809": 34583,
  "81": 6659,
  "810": 40215,
  "815": 49503,
  "82": 6469,
  "820": 41739,
  "825": 47338,
  "83": 5999,
  "830": 48341,
  "833": 48634,
  "84": 5705,
  "840": 40675,
  "85": 5332,
  "850": 25764,
  "855": 45432,
  "86": 4521,
  "860": 45039,
  "864": 39570,
  "866": 42240,
  "87": 5774,
  "870": 46951,
  "875": 31360,
  "877": 42802,
  "88": 3459,
  "880": 41655,
  "882": 42980,
  "883": 49287,
  "884": 40353,
  "885": 44230,
  "886": 44980,
  "887": 46660,
  "888": 28011,
  "889": 39121,
  "89": 4531,
  "893": 49682,
  "896": 48712,
  "899": 44093,
  "9": 24,
  "90": 3829,
  "900": 12865,
  "901": 46815,
  "905": 44928,
  "909": 44675,
  "91": 6420,
  "910": 43234,
  "911": 35549,
  "915": 40248,
  "916": 48894,
  "92": 5892,
  "920": 37128,
  "925": 46351,
  "93": 6052,
  "930": 45418,
  "94": 5824,
  "940": 46899,
  "949": 48581,
  "95": 3865,
  "950": 31027,
  "951": 50119,
  "952": 49234,
  "953": 49649,
  "954": 48372,
  "956": 50148,
  "96": 4846,
  "960": 39277,
  "968": 38956,
  "969": 38819,
  "97": 5607,
  "970": 43587,
  "975": 42716,
  "978": 32196,
  "98": 4089,
  "980": 40022,
  "985": 42250,
  "986": 49087,
  "987": 44183,
  "989": 42520,
  "99": 2079,
  "990": 34155,
  "992": 41561,
  "993": 44821,
  "994": 42691,
  "995": 33438,
  "996": 38565,
  "997": 39647,
  "998": 34808,
  "999": 17032,
  "9999": 24214,
  ":": 25,
  ":\"": 11097,
  ":#": 43922,
  ":'": 32105,
  ":(": 37498,
  ":,": 45299,
  ":-": 21912,
  ":/": 14079,
  "://": 1378,
  "::": 3712,
  "::::": 24022,
  "::::::::": 43661,
  ":[": 33250,
  ":\\": 7479,
  ":]": 47715,
  ":{": 29164,
  ";": 26,
  ";\"": 26033,
  ";;": 7665,
  ";;;;": 14223,
  ";;;;;;;;": 25887,
  ";;;;;;;;;;;;": 46939,
  ";}": 46956,
  "<": 27,
  "</": 3556,
  "<<": 16791,
  "<?": 47934,
  "<|endoftext|>": 50256,
  "=": 28,
  "=\"": 2625,
  "=\"\"": 33151,
  "=\"#": 25698,
  "=\"/": 35922,
  "=#": 46249,
  "=$": 43641,
  "='": 11639,
  "=(": 16193,
  "=-": 10779,
  "=-=-": 16822,
  "=-=-=-=-": 27584,
  "=-=-=-=-=-=-=-=-": 46402,
  "=/": 33223,
  "==": 855,
  "===": 18604,
  "====": 1421,
  "======": 50155,
  "========": 2559,
  "============": 25609,
  "================": 4770,
  "================================": 10052,
  "================================================================": 23926,
  "=>": 14804,
  "=[": 41888,
  "=\\\"": 17553,
  "=]": 48874,
  "={": 34758,
  "=~": 31820,
  "=~=~": 33813,
  ">": 29,
  ">\"": 24618,
  ">(": 33994,
  ">)": 43734,
  ">,": 22330,
  ">.": 28401,
  ">:": 31175,
  "><": 6927,
  "></": 12240,
  ">>": 4211,
  ">>>": 33409,
  ">>>>": 16471,
  ">>>>>>>>": 33717,
  ">>\\": 34516,
  ">[": 36937,
  ">]": 37981,
  "?": 30,
  "?!": 12248,
  "?!\"": 30823,
  "?\"": 1701,
  "?\",": 35379,
  "?\".": 43634,
  "?'": 8348,
  "?'\"": 26989,
  "?)": 10091,
  "?),": 33924,
  "?).": 29865,
  "?,": 21747,
  "?:": 27514,
  "??": 3548,
  "???": 28358,
  "????": 9805,
  "?????": 19622,
  "?????-": 25658,
  "?????-?????-": 31666,
  "????????": 35709,
  "?]": 26398,
  "?ãĢį": 42943,
  "@": 31,
  "@#": 41573,
  "@#&": 48193,
  "@@": 12404,
  "@@@@": 22675,
  "@@@@@@@@": 37991,
  "A": 32,
  "AA": 3838,
  "AAA": 29697,
  "AAAA": 17922,
  "AAAAAAAA": 43488,
  "AAF": 38540,
  "AB": 6242,
  "ABC": 24694,
  "ABLE": 17534,
  "AC": 2246,
  "ACA": 26576,
  "ACC": 26861,
  "ACE": 11598,
  "ACH": 16219,
  "ACK": 8120,
  "ACP": 33056,
  "ACT": 10659,
  "ACTED": 38542,
  "ACTION": 44710,
  "ACY": 43300,
  "AD": 2885,
  "ADA": 26853,
  "ADD": 29266,
  "ADE": 19266,
  "ADRA": 40517,
  "ADS": 47149,
  "ADVERTISEMENT": 19053,
  "AE": 14242,
  "AF": 8579,
  "AFP": 17449,
  "AFTA": 32106,
  "AG": 4760,
  "AGE": 11879,
  "AGES": 25552,
  "AH": 18429,
  "AI": 20185,
  "AIDS": 39338,
  "AIN": 29833,
  "AIR": 42149,
  "AK": 10206,
  "AKING": 43602,
  "AL": 1847,
  "ALD": 44071,
  "ALE": 21358,
  "ALK": 28082,
  "ALL": 7036,
  "ALLY": 19807,
  "ALS": 23333,
  "ALSE": 23719,
  "ALT": 31429,
  "ALTH": 40818,
  "AM": 2390,
  "AMA": 25087,
  "AMD": 28075,
  "AME": 10067,
  "AMES": 29559,
  "AMI": 43870,
  "AMP": 23518,
  "AMS": 40834,
  "AMY": 29428,
  "AN": 1565,
  "ANA": 31574,
  "ANC": 20940,
  "ANCE": 19240,
  "AND": 6981,
  "ANE": 30525,
  "ANG": 15567,
  "ANGE": 27746,
  "ANI": 43664,
  "ANK": 15154,
  "ANN": 22846,
  "ANS": 15037,
  "ANT": 8643,
  "ANY": 31827,
  "AP": 2969,
  "APD": 35349,
  "APE": 45721,
  "APH": 31300,
  "API": 17614,
  "APP": 24805,
  "APS": 44580,
  "APTER": 29485,
  "AR": 1503,
  "ARA": 24401,
  "ARB": 37304,
  "ARC": 25793,
  "ARCH": 31315,
  "ARD": 9795,
  "ARDIS": 49608,
  "ARDS": 48294,
  "ARE": 12203,
  "ARGET": 46095,
  "ARI": 33604,
  "ARK": 14175,
  "ARM": 33456,
  "ARP": 36035,
  "ARR": 26465,
  "ARS": 27415,
  "ART": 7227,
  "ARY": 13153,
  "AS": 1921,
  "ASC": 42643,
  "ASE": 11159,
  "ASED": 42827,
  "ASH": 11211,
  "ASHINGTON": 19436,
  "ASON": 36033,
  "ASS": 10705,
  "AST": 11262,
  "ASY": 26483,
  "AT": 1404,
  "ATA": 13563,
  "ATCH": 11417,
  "ATE": 6158,
  "ATED": 11617,
  "ATER": 23261,
  "ATES": 29462,
  "ATH": 12599,
  "ATHER": 45226,
  "ATING": 33881,
  "ATION": 6234,
  "ATIONAL": 29912,
  "ATIONS": 18421,
  "ATIVE": 37045,
  "ATOR": 25633,
  "ATS": 33586,
  "ATT": 17139,
  "ATTLE": 35455,
  "ATURE": 40086,
  "ATURES": 47471,
  "AU": 26830,
  "AUD": 48877,
  "AUT": 39371,
  "AV": 10116,
  "AW": 12298,
  "AX": 25922,
  "AY": 4792,
  "AZ": 22778,
  "Aaron": 34451,
  "Ab": 4826,
  "Ability": 22453,
  "About": 8585,
  "Above": 32397,
  "Abs": 24849,
  "Absolutely": 40501,
  "Abstract": 23839,
  "Abyss": 49073,
  "Ac": 12832,
  "Acc": 17320,
  "Accept": 38855,
  "Access": 15457,
  "Accessory": 41629,
  "According": 4821,
  "Account": 30116,
  "Acknowled": 39482,
  "Across": 40553,
  "Act": 6398,
  "Action": 12502,
  "ActionCode": 31573,
  "Activ": 25526,
  "Active": 13739,
  "Activity": 16516,
  "Actor": 40277,
  "Actually": 26417,
  "Ad": 2782,
  "Adam": 23159,
  "Adams": 47462,
  "Adapt": 48003,
  "Adapter": 47307,
  "Add": 4550,
  "Added": 13003,
  "Adding": 32901,
  "Additional": 17699,
  "Additionally": 23216,
  "Address": 20231,
  "Adds": 46245,
  "Adjust": 39668,
  "Admin": 46787,
  "Administ": 41862,
  "Adult": 42995,
  "Adv": 22856,
  "Advanced": 28809,
  "Adventure": 48289,
  "Advertisement": 4723,
  "Advertisements": 14592,
  "Af": 17584,
  "Afee": 44314,
  "Aff": 35191,
  "African": 43032,
  "After": 3260,
  "Ag": 10262,
  "Again": 15316,
  "Against": 39276,
  "Age": 23396,
  "Agent": 36772,
  "Agg": 46384,
  "Ah": 10910,
  "Aid": 44245,
  "Aim": 49945,
  "Air": 16170,
  "Ak": 33901,
  "Al": 2348,
  "Alabama": 49177,
  "Alan": 36235,
  "Albert": 42590,
  "Ale": 37474,
  "Alert": 36420,
  "Alex": 15309,
  "Alexander": 38708,
  "Ali": 37893,
  "Alias": 40489,
  "Alice": 44484,
  "Alien": 44501,
  "All": 3237,
  "Allah": 48620,
  "Allen": 39989,
  "Allow": 35265,
  "Allows": 34934,
  "Almost": 23379,
  "Along": 24035,
  "Alpha": 38077,
  "Already": 37447,
  "Alright": 31442,
  "Also": 7583,
  "Alt": 29161,
  "Altern": 23081,
  "Alternative": 49788,
  "Alternatively": 44163,
  "Although": 7003,
  "Always": 30374,
  "Am": 5840,
  "Amazing": 42770,
  "Amazon": 24888,
  "Amb": 35649,
  "Americ": 5477,
  "America": 18165,
  "American": 7437,
  "Americans": 17636,
  "Amid": 43541,
  "Among": 14311,
  "Amount": 31264,
  "Amy": 40797,
  "An": 2025,
  "Analy": 37702,
  "Analysis": 32750,
  "Ancient": 44974,
  "And": 1870,
  "Anderson": 42991,
  "Andre": 31258,
  "Andrew": 20508,
  "Android": 25934,
  "Andy": 35314,
  "Ang": 13450,
  "Angel": 33246,
  "Angelo": 45585,
  "Anim": 35320,
  "Animal": 40002,
  "Animation": 39520,
  "Ann": 18858,
  "Anna": 31160,
  "Anne": 43227,
  "Anonymous": 20660,
  "Another": 6610,
  "Answer": 33706,
  "Ant": 13217,
  "Anth": 30327,
  "Anthony": 32697,
  "Anti": 28795,
  "Any": 7149,
  "Anyone": 21129,
  "Anything": 40028,
  "Anyway": 23795,
  "Ap": 25189,
  "Apart": 39182,
  "App": 4677,
  "AppData": 22322,
  "Apparently": 30402,
  "Appearance": 48231,
  "Appearances": 47569,
  "Apple": 16108,
  "Applic": 33583,
  "Application": 23416,
  "Applications": 41995,
  "Apply": 44836,
  "Apps": 48433,
  "Apr": 13680,
  "April": 16784,
  "Ar": 3163,
  "Arab": 31602,
  "Arc": 24021,
  "Arcade": 43763,
  "Arch": 19895,
  "Are": 8491,
  "Area": 30547,
  "Aren": 43199,
  "Arg": 28100,
  "Args": 42035,
  "Ari": 26529,
  "Arizona": 40732,
  "Ark": 42007,
  "Arm": 26560,
  "Armor": 31512,
  "Army": 45272,
  "Around": 24472,
  "Array": 19182,
  "Arsenal": 46230,
  "Art": 8001,
  "Arthur": 29874,
  "Article": 14906,
  "Artist": 43020,
  "As": 1722,
  "Ash": 26754,
  "Asia": 38555,
  "Asian": 43224,
  "Aside": 32602,
  "Ask": 25214,
  "Asked": 18932,
  "Ass": 8021,
  "Assad": 23622,
  "Assembly": 49670,
  "Asset": 45869,
  "Assistant": 48902,
  "Associated": 29014,
  "Assuming": 48142,
  "Ast": 33751,
  "Async": 42367,
  "At": 2953,
  "Atl": 25255,
  "Atlanta": 43482,
  "Atlantic": 41120,
  "Att": 8086,
  "Attach": 33296,
  "Attack": 27732,
  "Attempt": 37177,
  "Attempts": 48452,
  "Attorney": 46319,
  "Attribute": 33682,
  "Attributes": 29021,
  "Aud": 16353,
  "Audio": 21206,
  "Aug": 12512,
  "August": 17908,
  "Aust": 15160,
  "Austin": 40245,
  "Austral": 19763,
  "Australia": 27429,
  "Australian": 38036,
  "Aut": 16541,
  "Auth": 30515,
  "Authent": 47649,
  "Author": 13838,
  "Authorities": 28705,
  "Auto": 27722,
  "Autom": 38062,
  "Av": 7355,
  "Availability": 29841,
  "Available": 10493,
  "Average": 26287,
  "Avg": 48997,
  "Avoid": 38618,
  "Aw": 23155,
  "Awesome": 49061,
  "Ax": 31554,
  "Ay": 42012,
  "Az": 26903,
  "B": 33,
  "BA": 4339,
  "BACK": 31098,
  "BALL": 45463,
  "BAT": 47379,
  "BB": 15199,
  "BBC": 33833,
  "BC": 2749,
  "BD": 14529,
  "BE": 12473,
  "BER": 13246,
  "BF": 29499,
  "BG": 40469,
  "BI": 3483,
  "BIL": 19676,
  "BILITIES": 49516,
  "BILITY": 25382,
  "BILL": 39888,
  "BIP": 47772,
  "BIT": 26094,
  "BL": 9148,
  "BLE": 19146,
  "BLIC": 32936,
  "BM": 12261,
  "BN": 15766,
  "BO": 8202,
  "BOOK": 39453,
  "BOX": 39758,
  "BP": 20866,
  "BR": 11473,
  "BRE": 40438,
  "BS": 4462,
  "BSD": 21800,
  "BT": 19313,
  "BTC": 35964,
  "BU": 19499,
  "BUG": 12953,
  "BUR": 38926,
  "BUS": 45346,
  "BUT": 47526,
  "BW": 48802,
  "BY": 17513,
  "Ba": 34458,
  "Baby": 36534,
  "Back": 7282,
  "Background": 21756,
  "Bad": 22069,
  "Bah": 47514,
  "Bal": 24597,
  "Balance": 45866,
  "Ball": 23410,
  "Balt": 41312,
  "Baltimore": 46139,
  "Ban": 30457,
  "Band": 31407,
  "Bang": 43984,
  "Bank": 28650,
  "Bar": 10374,
  "Barn": 47359,
  "Bas": 15522,
  "Base": 14881,
  "Based": 15001,
  "Basic": 26416,
  "Basically": 31524,
  "Bat": 24541,
  "Batman": 37039,
  "Battery": 47006,
  "Battle": 24064,
  "Bay": 15262,
  "Be": 3856,
  "Bear": 36352,
  "Beast": 41490,
  "Beat": 34979,
  "Beaut": 38413,
  "Bec": 39649,
  "Because": 8128,
  "Beck": 43454,
  "Bed": 45896,
  "Bee": 49512,
  "Beer": 49802,
  "Before": 8421,
  "Beg": 24586,
  "Begin": 44140,
  "Beginning": 45198,
  "Beh": 25267,
  "Behind": 34163,
  "Being": 18357,
  "Bel": 12193,
  "Bell": 36488,
  "Below": 21106,
  "Ben": 11696,
  "Bench": 44199,
  "Benef": 42166,
  "Benz": 42484,
  "Ber": 24814,
  "Bern": 23927,
  "Bernie": 33433,
  "Berry": 25215,
  "Besides": 23937,
  "Best": 13014,
  "Bet": 13056,
  "Beta": 43303,
  "Better": 28971,
  "Between": 25262,
  "Bey": 21993,
  "Beyond": 24102,
  "Bi": 23286,
  "Big": 12804,
  "Bill": 17798,
  "Billy": 49640,
  "Bind": 36180,
  "Bio": 42787,
  "Bir": 50091,
  "Bird": 42562,
  "Birth": 38480,
  "Bit": 13128,
  "Bitcoin": 22614,
  "Bl": 3629,
  "Black": 9915,
  "Blade": 47520,
  "Blake": 37849,
  "Ble": 43413,
  "Block": 12235,
  "Blocks": 45356,
  "Blog": 42383,
  "Blood": 21659,
  "Bloom": 38941,
  "Bloomberg": 47696,
  "Blu": 38676,
  "Blue": 14573,
  "Bo": 16635,
  "Board": 29828,
  "Bob": 18861,
  "Body": 25842,
  "Bomb": 48478,
  "Bon": 20682,
  "Bone": 49580,
  "Bonus": 29435,
  "Boo": 46120,
  "Book": 10482,
  "Books": 30650,
  "Boost": 45686,
  "Boot": 36476,
  "Border": 34189,
  "Born": 28524,
  "Boss": 37310,
  "Boston": 31710,
  "Bot": 20630,
  "Both": 10265,
  "Bott": 28653,
  "Bottom": 34104,
  "Bound": 49646,
  "Bow": 39961,
  "Box": 14253,
  "Boy": 26554,
  "Br": 9414,
  "Bra": 42333,
  "Brad": 30805,
  "Brain": 44687,
  "Brand": 38416,
  "Brandon": 45467,
  "Brave": 39787,
  "Brazil": 39190,
  "Bre": 12679,
  "Break": 31737,
  "Breaking": 29449,
  "Brend": 48015,
  "Brew": 44029,
  "Brexit": 40730,
  "Brian": 24761,
  "Bride": 47148,
  "Bridge": 37385,
  "Brien": 20118,
  "Bright": 41267,
  "Bring": 31416,
  "Brit": 17959,
  "Britain": 37114,
  "British": 25631,
  "Bro": 15783,
  "Broad": 30507,
  "Bron": 18760,
  "Brook": 45534,
  "Brother": 39461,
  "Brow": 32635,
  "Brown": 20644,
  "Browser": 46532,
  "Bruce": 38509,
  "Bs": 37000,
  "Bu": 38374,
  "Buff": 36474,
  "Buffer": 28632,
  "Bug": 25624,
  "Build": 15580,
  "Builder": 32875,
  "Building": 25954,
  "Built": 39582,
  "Bul": 33481,
  "Bull": 39549,
  "Bur": 22991,
  "Burn": 29053,
  "Bus": 16286,
  "Bush": 36113,
  "Business": 24749,
  "But": 1537,
  "Button": 21864,
  "Buy": 14518,
  "Buyable": 39693,
  "BuyableInstoreAndOnline": 40242,
  "Buzz": 48230,
  "By": 3886,
  "ById": 48364,
  "Byte": 40778,
  "Bytes": 45992,
  "C": 34,
  "CA": 8141,
  "CAN": 44565,
  "CAP": 33177,
  "CAR": 20034,
  "CAST": 44647,
  "CB": 23199,
  "CBC": 29208,
  "CBS": 22923,
  "CC": 4093,
  "CCC": 46361,
  "CD": 8610,
  "CDC": 47667,
  "CE": 5222,
  "CENT": 43960,
  "CEO": 46691,
  "CEPT": 42006,
  "CF": 22495,
  "CG": 39816,
  "CH": 3398,
  "CHA": 49285,
  "CHAPTER": 41481,
  "CHAR": 38019,
  "CHAT": 31542,
  "CHECK": 50084,
  "CHO": 44899,
  "CHQ": 47831,
  "CHR": 37846,
  "CI": 25690,
  "CIA": 49732,
  "CL": 5097,
  "CLA": 16827,
  "CLAIM": 48778,
  "CLASS": 31631,
  "CLASSIFIED": 45449,
  "CLE": 29931,
  "CLOSE": 32737,
  "CLUD": 39149,
  "CLUS": 28332,
  "CM": 24187,
  "CN": 44175,
  "CNN": 18474,
  "CO": 8220,
  "COL": 25154,
  "COLOR": 46786,
  "COM": 9858,
  "COMPLE": 41335,
  "CON": 10943,
  "CONCLUS": 47542,
  "CONT": 37815,
  "COR": 44879,
  "CP": 8697,
  "CPU": 36037,
  "CR": 9419,
  "CRE": 43387,
  "CRIP": 36584,
  "CRIPTION": 40165,
  "CS": 7902,
  "CSS": 49155,
  "CT": 4177,
  "CTV": 30428,
  "CU": 43633,
  "CV": 33538,
  "CVE": 31436,
  "CW": 43538,
  "Ca": 24334,
  "Cache": 30562,
  "Cal": 9771,
  "Calif": 19619,
  "California": 25284,
  "Call": 14134,
  "Callback": 47258,
  "Calling": 48593,
  "Cam": 21701,
  "Camera": 35632,
  "Camp": 21111,
  "Campaign": 46102,
  "Can": 6090,
  "Canada": 17940,
  "Canadian": 28203,
  "Cand": 41572,
  "Cap": 15610,
  "Capital": 39315,
  "Capt": 19209,
  "Captain": 27898,
  "Capture": 49630,
  "Car": 9914,
  "Card": 16962,
  "Care": 17784,
  "Carl": 26886,
  "Cart": 43476,
  "Carter": 49958,
  "Cas": 35155,
  "Case": 20448,
  "Cash": 35361,
  "Cass": 43529,
  "Cast": 19248,
  "Cat": 21979,
  "Catal": 39075,
  "Catalog": 49015,
  "Category": 27313,
  "Cath": 39581,
  "Catholic": 48919,
  "Cause": 42323,
  "Cele": 42741,
  "Cell": 28780,
  "Cent": 19085,
  "Center": 23656,
  "Central": 30645,
  "Cert": 37608,
  "Certain": 26469,
  "Certainly": 36001,
  "Ch": 1925,
  "Chain": 35491,
  "Chair": 43189,
  "Chall": 41812,
  "Champ": 48507,
  "Chan": 48407,
  "Chance": 43606,
  "Change": 19400,
  "Changed": 31813,
  "Changes": 29238,
  "Changing": 48333,
  "Channel": 29239,
  "Chapter": 14126,
  "Char": 12441,
  "Character": 27275,
  "Characters": 48393,
  "Charg": 28316,
  "Charge": 50044,
  "Charges": 36970,
  "Charl": 24453,
  "Charles": 28711,
  "Charlie": 37136,
  "Chart": 45488,
  "Chat": 30820,
  "Che": 7376,
  "Check": 9787,
  "Chel": 38292,
  "Chelsea": 41053,
  "Chem": 41829,
  "Chest": 45170,
  "Chicago": 25705,
  "Chicken": 45565,
  "Chief": 23675,
  "Child": 16424,
  "Children": 26829,
  "China": 14581,
  "Chinese": 23604,
  "Chip": 49985,
  "Cho": 22164,
  "Choice": 46770,
  "Choose": 31851,
  "Chris": 15645,
  "Christ": 10684,
  "Christian": 20298,
  "Christmas": 44614,
  "Christopher": 38025,
  "Chuck": 44324,
  "Church": 46686,
  "Circ": 31560,
  "City": 14941,
  "Civil": 32610,
  "Cl": 2601,
  "Cla": 47404,
  "Claim": 44819,
  "Clar": 48035,
  "Clark": 43250,
  "Class": 9487,
  "Classic": 39914,
  "Cle": 34349,
  "Clean": 32657,
  "Clear": 19856,
  "Clearly": 30638,
  "Click": 8164,
  "Client": 11792,
  "Climate": 37649,
  "Clinton": 16549,
  "Clock": 44758,
  "Close": 26125,
  "Closure": 45398,
  "Cloud": 18839,
  "Club": 42350,
  "Cmd": 40109,
  "Co": 7222,
  "Coach": 40677,
  "Cod": 43806,
  "Code": 10669,
  "Coin": 24387,
  "Col": 5216,
  "Cola": 28635,
  "Cold": 34312,
  "Cole": 46509,
  "Coll": 22667,
  "Collect": 31337,
  "Collection": 36307,
  "College": 38951,
  "Collins": 49645,
  "Color": 10258,
  "Colorado": 41330,
  "Columb": 36063,
  "Column": 39470,
  "Com": 5377,
  "Comb": 20575,
  "Combat": 38667,
  "Come": 16773,
  "Coming": 30804,
  "Comm": 6935,
  "Command": 21575,
  "Comment": 21357,
  "Comments": 23903,
  "Commerce": 47662,
  "Commercial": 48401,
  "Commission": 50246,
  "Common": 17227,
  "Commun": 30813,
  "Community": 20012,
  "Comp": 7293,
  "Compan": 41309,
  "Companies": 49111,
  "Company": 39154,
  "Compar": 50249,
  "Compare": 41488,
  "Compared": 44669,
  "Compat": 40073,
  "Compl": 38143,
  "Complete": 20988,
  "Completed": 43768,
  "Component": 21950,
  "Computer": 34556,
  "Con": 3103,
  "Conclusion": 21481,
  "Cond": 25559,
  "Condition": 48362,
  "Conf": 18546,
  "Config": 16934,
  "Configuration": 38149,
  "Cong": 18649,
  "Congratulations": 45048,
  "Congress": 25916,
  "Conn": 37321,
  "Connect": 13313,
  "Connection": 32048,
  "Connector": 34525,
  "Connell": 15559,
  "Connor": 27136,
  "Cons": 9444,
  "Conservative": 42039,
  "Consider": 19626,
  "Considering": 40475,
  "Console": 47581,
  "Const": 34184,
  "Construct": 42316,
  "Constructed": 25207,
  "Construction": 36687,
  "Consumer": 49106,
  "Cont": 4264,
  "Contact": 17829,
  "Container": 29869,
  "Content": 19746,
  "Contents": 15842,
  "Context": 21947,
  "Contin": 17875,
  "Continue": 29453,
  "Contract": 45845,
  "Contribut": 37146,
  "Control": 15988,
  "Controller": 22130,
  "Cook": 28937,
  "Cool": 34530,
  "Cooldown": 45953,
  "Cop": 13379,
  "Copy": 29881,
  "Copyright": 15269,
  "Cor": 10606,
  "Core": 14055,
  "Corn": 41389,
  "Corp": 45680,
  "Correct": 42779,
  "Correction": 43267,
  "Cos": 36734,
  "Cost": 13729,
  "Could": 23722,
  "Coun": 31053,
  "Council": 40940,
  "Count": 12332,
  "Counter": 31694,
  "Country": 33921,
  "Cour": 25877,
  "Course": 49046,
  "Court": 36699,
  "Courtesy": 31825,
  "Cover": 27245,
  "Cow": 40147,
  "Cr": 13916,
  "Cra": 33800,
  "Craft": 14467,
  "Craig": 40441,
  "Crash": 47598,
  "Cre": 12443,
  "Creat": 16719,
  "Create": 16447,
  "Created": 41972,
  "Creating": 32071,
  "Credit": 23690,
  "Credits": 42855,
  "Crew": 46724,
  "Crime": 45580,
  "Crit": 18559,
  "Critical": 41000,
  "Critics": 36623,
  "Cro": 35403,
  "Cross": 21544,
  "Cru": 27535,
  "Crunch": 49384,
  "Cruz": 41811,
  "Cry": 26677,
  "Crypt": 23919,
  "Crystal": 43752,
  "Cs": 32274,
  "Ct": 33707,
  "Ctrl": 40069,
  "Cu": 46141,
  "Cub": 43632,
  "Cube": 29071,
  "Cur": 26628,
  "Current": 11297,
  "Currently": 21327,
  "Custom": 15022,
  "Customer": 44939,
  "Cut": 26254,
  "Cy": 20418,
  "D": 35,
  "DA": 5631,
  "DAQ": 46640,
  "DATA": 26947,
  "DAY": 26442,
  "DB": 11012,
  "DC": 9697,
  "DCS": 49513,
  "DD": 16458,
  "DE": 7206,
  "DEBUG": 30531,
  "DEC": 41374,
  "DEF": 32988,
  "DEM": 39429,
  "DEN": 41819,
  "DEP": 46162,
  "DER": 14418,
  "DERR": 49643,
  "DES": 30910,
  "DEV": 39345,
  "DF": 8068,
  "DH": 41473,
  "DI": 17931,
  "DIR": 34720,
  "DIS": 26288,
  "DIT": 49828,
  "DIV": 33569,
  "DJ": 35028,
  "DK": 48510,
  "DL": 19260,
  "DM": 23127,
  "DN": 35504,
  "DNA": 28886,
  "DO": 18227,
  "DOC": 38715,
  "DOM": 39170,
  "DON": 41173,
  "DOS": 35178,
  "DOWN": 41925,
  "DP": 6322,
  "DR": 7707,
  "DS": 5258,
  "DT": 24544,
  "DVD": 39218,
  "DW": 42955,
  "DX": 36227,
  "Da": 26531,
  "Dad": 46270,
  "Daddy": 48280,
  "Daily": 28545,
  "Dallas": 40540,
  "Dam": 14550,
  "Damage": 22022,
  "Damn": 43343,
  "Dan": 21174,
  "Daniel": 19962,
  "Danny": 45478,
  "Dar": 32708,
  "Dark": 17367,
  "Dash": 43041,
  "Dat": 27354,
  "Data": 6601,
  "Database": 38105,
  "Date": 10430,
  "Dave": 27984,
  "David": 11006,
  "Davis": 36462,
  "Day": 12393,
  "Days": 38770,
  "Db": 43832,
  "De": 5005,
  "Dead": 20489,
  "Deal": 45776,
  "Dean": 36372,
  "Dear": 20266,
  "Death": 20148,
  "Deb": 16587,
  "Debug": 27509,
  "Dec": 10707,
  "December": 20588,
  "Decl": 37835,
  "Decre": 43198,
  "Deep": 29744,
  "Def": 7469,
  "Default": 19463,
  "Defense": 27300,
  "Definition": 36621,
  "Del": 13856,
  "Delete": 38727,
  "Delivery": 33129,
  "DeliveryDate": 39749,
  "Delta": 42430,
  "Dem": 11522,
  "Demand": 42782,
  "Democratic": 33939,
  "Democrats": 29969,
  "Demon": 35477,
  "Den": 21306,
  "Denver": 49818,
  "Dep": 12156,
  "Department": 36261,
  "Depending": 41156,
  "Deploy": 49322,
  "Depth": 48791,
  "Depths": 42382,
  "Der": 28532,
  "Des": 5960,
  "Desc": 24564,
  "Description": 11828,
  "Design": 23067,
  "Desk": 42523,
  "Desktop": 36881,
  "Despite": 8332,
  "Dest": 24159,
  "Destroy": 49174,
  "Det": 11242,
  "Detailed": 32080,
  "Details": 24259,
  "Detect": 47504,
  "Detroit": 40404,
  "Dev": 13603,
  "Develop": 19246,
  "Developer": 45351,
  "Development": 41206,
  "Device": 24728,
  "Dex": 48875,
  "Di": 18683,
  "Dial": 24400,
  "Dialog": 44204,
  "Dialogue": 41099,
  "Diamond": 47710,
  "Dick": 38743,
  "Did": 11633,
  "Die": 32423,
  "Diff": 28813,
  "Different": 40341,
  "Dig": 19511,
  "Digital": 27640,
  "Dim": 29271,
  "Dir": 35277,
  "Direct": 13470,
  "Director": 28702,
  "Directory": 43055,
  "Dis": 7279,
  "Disable": 48893,
  "Disc": 15642,
  "Disclaimer": 19618,
  "Discover": 44596,
  "Discuss": 48873,
  "Discussion": 34255,
  "Disk": 40961,
  "Disney": 37338,
  "Dispatch": 49354,
  "Display": 23114,
  "Dist": 20344,
  "Distance": 45767,
  "District": 44857,
  "Div": 24095,
  "Do": 5211,
  "DoS": 46498,
  "Doc": 23579,
  "Doctor": 37564,
  "Doctors": 47087,
  "Document": 24941,
  "Documents": 38354,
  "Does": 13921,
  "Dog": 32942,
  "Dom": 24510,
  "Domain": 43961,
  "Domin": 43417,
  "Don": 3987,
  "Donald": 7371,
  "DonaldTrump": 27674,
  "Done": 45677,
  "Donnell": 24853,
  "Dou": 40287,
  "Double": 25628,
  "Doug": 42297,
  "Down": 8048,
  "Download": 10002,
  "Downloadha": 41551,
  "Dr": 6187,
  "Draft": 37741,
  "Drag": 46022,
  "Dragon": 17808,
  "DragonMagazine": 42424,
  "Draw": 25302,
  "Dream": 30571,
  "Dri": 20564,
  "Drive": 24825,
  "Driver": 32103,
  "Dro": 35442,
  "Drop": 26932,
  "Drug": 37943,
  "Ds": 30832,
  "Du": 35660,
  "Dual": 36248,
  "Dub": 37590,
  "Due": 22229,
  "Dun": 30128,
  "Dur": 36927,
  "Duration": 26054,
  "During": 7191,
  "Dust": 43767,
  "Dutch": 49717,
  "Dynamic": 44090,
  "E": 36,
  "EA": 16412,
  "EAR": 17133,
  "EB": 30195,
  "EC": 2943,
  "ECA": 36600,
  "ECD": 27295,
  "ECH": 25994,
  "ECK": 25171,
  "ECT": 9782,
  "ECTION": 24565,
  "ED": 1961,
  "EDIT": 24706,
  "EE": 6500,
  "EED": 41841,
  "EEE": 31909,
  "EEEE": 35039,
  "EEK": 33823,
  "EEP": 35238,
  "EF": 25425,
  "EFF": 37267,
  "EG": 7156,
  "EGA": 33146,
  "EGIN": 43312,
  "EH": 42413,
  "EL": 3698,
  "ELD": 24639,
  "ELF": 37738,
  "ELL": 23304,
  "ELS": 37142,
  "ELY": 30943,
  "EM": 3620,
  "EMA": 27630,
  "EMBER": 28952,
  "EMENT": 12529,
  "EMOTE": 36862,
  "EMP": 39494,
  "EMS": 39201,
  "EN": 1677,
  "ENA": 45510,
  "ENC": 24181,
  "ENCE": 18310,
  "ENCY": 45155,
  "END": 10619,
  "ENDED": 49361,
  "ENE": 39267,
  "ENG": 26808,
  "ENGTH": 49494,
  "ENN": 34571,
  "ENS": 16938,
  "ENSE": 24290,
  "ENT": 3525,
  "ENTION": 45589,
  "ENTS": 15365,
  "EO": 4720,
  "EP": 8905,
  "EPA": 40906,
  "ER": 1137,
  "ERA": 46461,
  "ERAL": 27130,
  "ERC": 47691,
  "ERE": 9338,
  "ERG": 49837,
  "ERN": 28778,
  "ERO": 34812,
  "ERROR": 24908,
  "ERS": 4877,
  "ERSON": 29086,
  "ERT": 17395,
  "ERY": 19664,
  "ES": 1546,
  "ESA": 43279,
  "ESCO": 43311,
  "ESE": 33635,
  "ESH": 44011,
  "ESPN": 31730,
  "ESS": 7597,
  "ESSION": 47621,
  "EST": 6465,
  "EStream": 39906,
  "EStreamFrame": 43177,
  "ET": 2767,
  "ETA": 20892,
  "ETF": 22274,
  "ETH": 20702,
  "ETHOD": 36252,
  "ETS": 32716,
  "EU": 19684,
  "EV": 20114,
  "EVA": 27881,
  "EW": 6217,
  "EX": 6369,
  "EXP": 49864,
  "EXT": 13918,
  "EY": 22348,
  "Each": 10871,
  "Ear": 8419,
  "Earlier": 13689,
  "Early": 20457,
  "Earn": 49725,
  "Earth": 22840,
  "East": 25234,
  "Eastern": 46109,
  "Easy": 28406,
  "Eat": 47659,
  "Ec": 49136,
  "Econom": 28489,
  "Economic": 48307,
  "Ed": 7407,
  "Edge": 37021,
  "Edit": 18378,
  "Edited": 45882,
  "Editor": 17171,
  "Educ": 33380,
  "Education": 41183,
  "Edward": 43982,
  "Effect": 18610,
  "Effective": 44831,
  "Effects": 47738,
  "Egypt": 39299,
  "Eh": 43894,
  "Eight": 29571,
  "Either": 32478,
  "El": 9527,
  "Ele": 28827,
  "Elect": 19453,
  "Electric": 44132,
  "Element": 20180,
  "Elf": 46995,
  "Elizabeth": 43568,
  "Ell": 30639,
  "Els": 45507,
  "Elsa": 49050,
  "Else": 40674,
  "Elsewhere": 49374,
  "Em": 10161,
  "Email": 15333,
  "Emb": 31567,
  "Emer": 32779,
  "Emergency": 48979,
  "Emily": 48640,
  "Employ": 29733,
  "Empty": 40613,
  "En": 4834,
  "Enable": 36695,
  "Enabled": 20491,
  "Enc": 27195,
  "End": 12915,
  "Energy": 28925,
  "Eng": 7936,
  "Engine": 13798,
  "EngineDebug": 49781,
  "Engineers": 28620,
  "England": 39163,
  "English": 15823,
  "Enh": 35476,
  "Enhanced": 49026,
  "Enjoy": 27467,
  "Enlarge": 30952,
  "Enough": 47323,
  "Ent": 14539,
  "Enter": 17469,
  "Entity": 32398,
  "Entry": 30150,
  "Environment": 31441,
  "Environmental": 47213,
  "Ep": 13807,
  "Episode": 23758,
  "Equ": 23588,
  "Er": 9139,
  "Eric": 25004,
  "Error": 12331,
  "Es": 23041,
  "Esc": 47051,
  "Especially": 48464,
  "Ess": 29508,
  "Est": 22362,
  "Eth": 40226,
  "Euro": 14398,
  "Europe": 16112,
  "European": 22030,
  "Ev": 15200,
  "Eva": 44239,
  "Even": 6104,
  "Event": 9237,
  "Events": 37103,
  "Eventually": 28724,
  "Ever": 23921,
  "Every": 6109,
  "Everybody": 28172,
  "Everyone": 16190,
  "Everything": 19693,
  "Evidence": 46785,
  "Evil": 48477,
  "Ex": 3109,
  "Exactly": 47173,
  "Example": 16281,
  "Examples": 27730,
  "Exc": 40127,
  "Excellent": 45675,
  "Except": 30313,
  "Exception": 16922,
  "Exec": 23002,
  "Executive": 43885,
  "Exit": 30337,
  "Exp": 16870,
  "Exper": 20468,
  "Experience": 44901,
  "Experts": 38897,
  "Expl": 18438,
  "Explore": 35433,
  "Export": 43834,
  "Express": 38839,
  "Ext": 11627,
  "External": 41506,
  "Extra": 27726,
  "Extreme": 36716,
  "Ey": 36287,
  "Eye": 24876,
  "F": 37,
  "FA": 7708,
  "FACE": 49836,
  "FAQ": 42680,
  "FAULT": 38865,
  "FB": 26001,
  "FBI": 39379,
  "FC": 4851,
  "FD": 26009,
  "FE": 15112,
  "FER": 24302,
  "FF": 5777,
  "FFER": 45746,
  "FFFF": 29312,
  "FG": 30386,
  "FH": 44602,
  "FI": 11674,
  "FIELD": 44603,
  "FIG": 16254,
  "FIL": 46700,
  "FILE": 25664,
  "FIN": 20032,
  "FINE": 29940,
  "FINEST": 40236,
  "FIR": 39776,
  "FIX": 47084,
  "FK": 26236,
  "FL": 3697,
  "FLAG": 38948,
  "FM": 23264,
  "FML": 34708,
  "FN": 43221,
  "FO": 6080,
  "FOR": 13775,
  "FORE": 30818,
  "FORM": 21389,
  "FORMATION": 35036,
  "FOX": 47853,
  "FP": 5837,
  "FR": 10913,
  "FREE": 39274,
  "FS": 10652,
  "FT": 9792,
  "FTWARE": 37485,
  "FU": 38989,
  "FUL": 46476,
  "FUN": 42296,
  "FW": 24160,
  "FX": 17213,
  "FY": 43833,
  "Fa": 50110,
  "Fab": 43957,
  "Fac": 47522,
  "Face": 32388,
  "Facebook": 12025,
  "Fact": 29054,
  "Factor": 41384,
  "Factory": 22810,
  "FactoryReloaded": 37631,
  "Fail": 39044,
  "Failure": 50015,
  "Fair": 30099,
  "Faith": 45536,
  "Fake": 49233,
  "Fal": 41129,
  "Fall": 24750,
  "False": 25101,
  "Family": 24094,
  "Fan": 22480,
  "Fans": 36570,
  "Far": 21428,
  "Farm": 48412,
  "Fast": 22968,
  "Fat": 33804,
  "Father": 34823,
  "Favorite": 49434,
  "Fax": 46512,
  "Fe": 14304,
  "Fear": 37798,
  "Feature": 38816,
  "Featured": 37948,
  "Features": 23595,
  "Feb": 15146,
  "February": 21816,
  "Fed": 42268,
  "Federal": 24099,
  "Feed": 18332,
  "Feel": 35114,
  "Fel": 42493,
  "Female": 27273,
  "Fer": 43362,
  "Fest": 45139,
  "Few": 32351,
  "Fi": 10547,
  "Field": 15878,
  "Fif": 44403,
  "Fig": 14989,
  "Fight": 27365,
  "Fighting": 46375,
  "Figure": 11337,
  "Fil": 11928,
  "File": 8979,
  "Filename": 35063,
  "Files": 25876,
  "Fill": 33762,
  "Film": 39750,
  "Filter": 22417,
  "Fin": 18467,
  "Final": 19006,
  "Finally": 11158,
  "Financial": 43621,
  "Find": 16742,
  "Finding": 36276,
  "Fine": 34389,
  "Finish": 48658,
  "Fire": 13543,
  "First": 5962,
  "Firstly": 49709,
  "Fish": 39428,
  "Fit": 31805,
  "Five": 20029,
  "Fix": 22743,
  "Fixed": 13715,
  "Fl": 7414,
  "Fla": 47487,
  "Flag": 34227,
  "Flags": 40053,
  "Flash": 30670,
  "Fle": 47669,
  "Flickr": 47250,
  "Flight": 43069,
  "Flo": 33574,
  "Float": 43879,
  "Flor": 26953,
  "Florida": 31135,
  "Flow": 37535,
  "Fly": 33771,
  "Flying": 49095,
  "Focus": 34888,
  "Folder": 41092,
  "Follow": 7155,
  "Following": 14291,
  "Font": 23252,
  "FontSize": 38160,
  "Food": 24602,
  "Foot": 17574,
  "Football": 37316,
  "Footnote": 33795,
  "For": 1890,
  "Force": 10292,
  "Ford": 37308,
  "Fore": 16351,
  "Foreign": 33616,
  "Forest": 34605,
  "Forge": 19857,
  "ForgeModLoader": 24934,
  "Form": 8479,
  "Format": 26227,
  "Former": 14282,
  "Fort": 21926,
  "Fortunately": 31276,
  "Forward": 39746,
  "Found": 21077,
  "Four": 15137,
  "Fourth": 45530,
  "Fox": 19399,
  "Fr": 6732,
  "Fra": 49562,
  "Frag": 42974,
