const translation = { // Add the Ukrainian translation object
  createApp: 'Створити новий додаток',
  types: {
    all: 'Всі',
    assistant: 'Асистент',
    completion: 'Автодоповнення',
  },
  modes: {
    completion: 'Генератор тексту',
    chat: 'Базовий асистент',
  },
  createFromConfigFile: 'Створити додаток з файла конфігурації',
  deleteAppConfirmTitle: 'Видалити цей додаток?',
  deleteAppConfirmContent:
      'Видалення додатка є незворотнім. Користувачі більше не матимуть доступ до вашого додатка, всі конфігурації підказок та журнали будуть видалені назавжди.',
  appDeleted: 'Додаток видалено',
  appDeleteFailed: 'Не вдалося видалити додаток',
  join: 'Приєднуйтесь до спільноти',
  communityIntro:
      'Обговорюйте різні питання з членами команди, учасниками та розробниками на різних каналах.',
  roadmap: 'Ознайомтеся з нашою дорожньою картою',
  appNamePlaceholder: 'Будь ласка, введіть назву додатка',
  newApp: {
    startToCreate: 'Давайте створимо Ваш новий додаток',
    captionName: 'Значок та назва додатка',
    captionAppType: 'Який тип додатка Ви бажаєте створити?',
    previewDemo: 'Попередній перегляд демо',
    chatApp: 'Асистент',
    chatAppIntro:
        'Я хочу створити чат-додаток. Цей додаток використовує формат запитань та відповідей, що дозволяє проводити кілька раундів безперервної розмови.',
    agentAssistant: 'Новий агент-асистент',
    completeApp: 'Генератор тексту',
    completeAppIntro:
        'Я хочу створити додаток, який генерує високоякісний текст на основі підказок, наприклад, створення статей, резюме, перекладів тощо.',
    showTemplates: 'Я хочу вибрати з шаблону',
    hideTemplates: 'Повернутися до вибору режиму',
    Create: 'Створити',
    Cancel: 'Скасувати',
    nameNotEmpty: 'Назва не може бути пустою',
    appTemplateNotSelected: 'Будь ласка, виберіть шаблон',
    appTypeRequired: 'Будь ласка, виберіть тип додатка',
    appCreated: 'Додаток створено',
    appCreateFailed: 'Не вдалося створити додаток',
  },
  editApp: {
    startToEdit: 'Редагувати додаток',
  },
  emoji: {
    ok: 'OK',
    cancel: 'Скасувати',
  },
}

export default translation
