const translation = {
  creation: {
    createFromScratch: {
      title: 'Порожній конвеєр знань',
      description: 'Створіть кастомну воронку продажів з нуля з повним контролем над обробкою та структурою даних.',
    },
    caution: 'Обережність',
    backToKnowledge: 'Назад до знань',
    createKnowledge: 'Створюйте знання',
    successTip: 'Успішно створили Базу знань',
    importDSL: 'Імпорт із файлу DSL',
    errorTip: 'Не вдалося створити базу знань',
  },
  templates: {
    customized: 'Налаштувати',
  },
  operations: {
    process: 'Процес',
    choose: 'Вибирати',
    details: 'Деталі',
    convert: 'Перетворити',
    dataSource: 'Джерело даних',
    preview: 'Попередній перегляд',
    exportPipeline: 'Пайплайн експорту',
    saveAndProcess: 'Зберегти та обробити',
    editInfo: 'Редагувати інформацію',
    backToDataSource: 'Назад до джерела даних',
    useTemplate: 'Використовуйте цей конвеєр знань',
  },
  deletePipeline: {
    title: 'Ви впевнені, що видалили цей шаблон пайплайну?',
    content: 'Видалення шаблону трубопроводу є незворотнім.',
  },
  publishPipeline: {
    success: {
      message: 'Опубліковано портфель знань',
    },
    error: {
      message: 'Не вдалося опублікувати конвеєр знань',
    },
  },
  publishTemplate: {
    success: {
      learnMore: 'Дізнатися більше',
      message: 'Опубліковано шаблон пайплайну',
      tip: 'Ви можете використовувати цей шаблон на сторінці створення.',
    },
    error: {
      message: 'Не вдалося опублікувати шаблон пайплайну',
    },
  },
  exportDSL: {
    successTip: 'Успішний експорт DSL воронки продажів',
    errorTip: 'Не вдалося експортувати DSL пайплайну',
  },
  details: {
    structure: 'Структура',
    structureTooltip: 'Структура фрагментів визначає, як документи розділяються та індексуються (пропонуючи режими «Загальні», «Батьки-дочірні елементи» та «Запитання й відповіді»), і є унікальною для кожної бази знань.',
  },
  testRun: {
    steps: {
      dataSource: 'Джерело даних',
      documentProcessing: 'Обробка документів',
    },
    dataSource: {
      localFiles: 'Локальні файли',
    },
    notion: {
      docTitle: 'Notion docs',
      title: 'Обирайте сторінки Notion',
    },
    title: 'Тестовий запуск',
    tooltip: 'У режимі тестового запуску дозволяється імпортувати лише один документ за раз для полегшення налагодження та спостереження.',
  },
  inputFieldPanel: {
    uniqueInputs: {
      title: 'Унікальні входи для кожного входу',
      tooltip: 'Унікальні входи доступні лише для вибраного джерела даних та його подальших вузлів. Користувачам не потрібно буде заповнювати його при виборі інших джерел даних. На першому кроці з\'являться лише поля введення, на які посилаються змінні джерела даних (Джерело даних). Всі інші поля будуть показані на другому кроці (Обробка документів).',
    },
    globalInputs: {
      title: 'Глобальні входи для всіх входів',
      tooltip: 'Глобальні входи є спільними для всіх вузлів. Користувачам потрібно буде заповнити їх при виборі будь-якого джерела даних. Наприклад, такі поля, як роздільник і максимальна довжина фрагмента, можуть бути однаково застосовані до кількох джерел даних. На першому кроці відображаються лише поля вводу, на які посилаються змінні джерела даних (джерело даних). Усі інші поля з\'являться на другому кроці (Обробка документів).',
    },
    preview: {
      stepOneTitle: 'Джерело даних',
      stepTwoTitle: 'Обробляти документи',
    },
    error: {
      variableDuplicate: 'Ім\'я змінної вже існує. Будь ласка, виберіть іншу назву.',
    },
    addInputField: 'Додати поле введення',
    editInputField: 'Редагувати поле введення',
    title: 'Поля для введення даних користувачем',
    description: 'Поля введення користувача використовуються для визначення та збору змінних, необхідних під час виконання воронки продажів. Користувачі можуть налаштовувати тип поля та гнучко налаштовувати вхідне значення для задоволення потреб різних джерел даних або етапів обробки документів.',
  },
  addDocuments: {
    steps: {
      processingDocuments: 'Оформлення документів',
      processDocuments: 'Обробляти документи',
      chooseDatasource: 'Виберіть джерело даних',
    },
    stepOne: {
      preview: 'Попередній перегляд',
    },
    stepTwo: {
      chunkSettings: 'Налаштування фрагментів',
      previewChunks: 'Фрагменти попереднього перегляду',
    },
    stepThree: {
      learnMore: 'Дізнатися більше',
    },
    characters: 'Символів',
    backToDataSource: 'Джерело даних',
    title: 'Додати документи',
  },
  documentSettings: {
    title: 'Параметри документа',
  },
  onlineDocument: {},
  onlineDrive: {
    breadcrumbs: {
      allFiles: 'Всі файли',
      searchPlaceholder: 'Пошук файлів...',
      allBuckets: 'Усі сегменти хмарного сховища',
    },
    emptyFolder: 'Ця папка порожня',
    emptySearchResult: 'Предметів не знайдено',
    resetKeywords: 'Скидання ключових слів',
    notSupportedFileType: 'Цей тип файлу не підтримується',
  },
  credentialSelector: {},
  conversion: {
    confirm: {
      title: 'Підтвердження',
      content: 'Ця дія є постійною. Ви не зможете повернутися до попереднього способу. Будь ласка, підтвердьте конвертацію.',
    },
    title: 'Перетворення на конвеєр знань',
    warning: 'Цю дію не можна скасувати.',
    successMessage: 'Успішно перетворили набір даних у пайплайн',
    errorMessage: 'Не вдалося перетворити набір даних у пайплайн',
    descriptionChunk2: '— більш відкритий та гнучкий підхід з доступом до плагінів з нашого маркетплейсу. Це застосує новий метод обробки до всіх майбутніх документів.',
    descriptionChunk1: 'Тепер ви можете перетворити наявну базу знань на використання Knowledge Pipeline для обробки документів',
  },
  knowledgeDescription: 'Опис знань',
  knowledgePermissions: 'Дозволи',
  inputField: 'Поле введення',
  knowledgeNameAndIcon: 'Знання ім\'я та піктограма',
  knowledgeNameAndIconPlaceholder: 'Будь ласка, введіть назву Бази знань',
  pipelineNameAndIcon: 'Назва та піктограма воронки продажів',
  editPipelineInfo: 'Як редагувати інформацію про воронку продажів',
  knowledgeDescriptionPlaceholder: 'Опишіть, що є в цій Базі знань. Детальний опис дозволяє штучному інтелекту більш точно отримати доступ до вмісту набору даних. Якщо значення порожнє, Dify використовуватиме стратегію удару за замовчуванням. (Необов\'язково)',
}

export default translation
