const translation = {
  tips: {
    notLoggedIn: 'Цей додаток хоче отримати доступ до вашого облікового запису Dify Cloud',
    needLogin: 'Будь ласка, увійдіть, щоб авторизуватися.',
    loggedIn: 'Цей додаток хоче отримати доступ до наступної інформації з вашого облікового запису Dify Cloud.',
    common: 'Ми поважаємо вашу конфіденційність і використовуватимемо цю інформацію лише для покращення вашого досвіду з нашими інструментами для розробників.',
  },
  scopes: {
    languagePreference: 'Перевага мови',
    name: 'Ім\'я',
    email: 'Електронна пошта',
    avatar: 'Аватар',
    timezone: 'Часовий пояс',
  },
  error: {
    invalidParams: 'Недійсні параметри',
    authorizeFailed: 'Авторизація не вдалася',
    authAppInfoFetchFailed: 'Не вдалося отримати інформацію про додаток для авторизації',
  },
  login: 'Увійти',
  unknownApp: 'Невідома програма',
  continue: 'Продовжувати',
  switchAccount: 'Переключити акаунт',
  connect: 'Підключитися до',
}

export default translation
