const translation = {
  common: {
    publishAsPipeline: {
      description: 'Опис знань',
      namePlaceholder: 'Будь ласка, введіть назву цього конвеєра знань. (Вимагається)',
      descriptionPlaceholder: 'Будь ласка, введіть опис цього конвеєра знань. (Необов\'язково)',
      name: 'Назва та піктограма воронки продажів',
    },
    processing: 'Обробки',
    testRun: 'Тестовий запуск',
    reRun: 'Повторний запуск',
    goToAddDocuments: 'Перейти до додавання документів',
    preparingDataSource: 'Підготовка джерела даних',
    confirmPublish: 'Підтвердити публікацію',
    publishAs: 'Публікація у вигляді конвеєра знань',
    confirmPublishContent: 'Після успішної публікації конвеєра знань структура фрагментів цієї бази знань не може бути змінена. Ви впевнені, що хочете його опублікувати?',
  },
  inputField: {
    manage: 'Керувати',
    create: 'Створити поле для введення даних користувачем',
  },
  publishToast: {
    title: 'Цей трубопровід поки що не опублікований',
    desc: 'Якщо конвеєр не опубліковано, ви можете змінити структуру фрагментів у вузлі бази знань, і оркестрація та зміни в конвеєрі будуть автоматично збережені як чернетка.',
  },
  result: {
    resultPreview: {
      loading: 'Обробки... Будь ласка, зачекай',
      viewDetails: 'Перегляд докладних відомостей',
      error: 'Під час виконання сталася помилка',
    },
  },
  ragToolSuggestions: {
    title: 'Пропозиції щодо RAG',
  },
}

export default translation
