const translation = {
  feature: {
    fileUpload: {
      title: 'การอัปโหลดไฟล์',
      description: 'กล่องข้อความแชทช่วยให้สามารถอัปโหลดรูปภาพ เอกสาร และไฟล์อื่นๆ ได้',
      supportedTypes: 'ประเภทไฟล์ที่รองรับ',
      numberLimit: 'จำนวนสูงสุดที่อัปโหลดได้',
      modalTitle: 'การตั้งค่าการอัปโหลดไฟล์',
    },
    imageUpload: {
      title: 'การอัปโหลดรูปภาพ',
      description: 'อนุญาตให้อัปโหลดรูปภาพได้',
      supportedTypes: 'ประเภทไฟล์ที่รองรับ',
      numberLimit: 'จำนวนสูงสุดที่อัปโหลดได้',
      modalTitle: 'การตั้งค่าการอัปโหลดรูปภาพ',
    },
    bar: {
      empty: 'เปิดใช้งานคุณสมบัติเพื่อเพิ่มประสบการณ์ผู้ใช้ของเว็บแอป',
      enableText: 'เปิดใช้งานคุณสมบัติแล้ว',
      manage: 'จัดการ',
    },
    documentUpload: {
      title: 'เอกสาร',
      description: 'การเปิดใช้งานเอกสารจะทำให้โมเดลสามารถรับเอกสารและตอบคำถามเกี่ยวกับเอกสารเหล่านั้นได้',
    },
    audioUpload: {
      title: 'เสียง',
      description: 'การเปิดใช้งานเสียงจะทำให้โมเดลสามารถประมวลผลไฟล์เสียงเพื่อการถอดข้อความและการวิเคราะห์ได้',
    },
  },
}

export default translation
