const translation = {
  creation: {
    createFromScratch: {
      title: 'ไปป์ไลน์ความรู้เปล่า',
      description: 'สร้างไปป์ไลน์แบบกําหนดเองตั้งแต่เริ่มต้นด้วยการควบคุมการประมวลผลและโครงสร้างข้อมูลอย่างเต็มที่',
    },
    caution: 'ความระมัดระวัง',
    createKnowledge: 'สร้างความรู้',
    importDSL: 'นําเข้าจากไฟล์ DSL',
    backToKnowledge: 'กลับไปที่ความรู้',
    successTip: 'สร้างฐานความรู้สําเร็จ',
    errorTip: 'สร้างฐานความรู้ไม่สําเร็จ',
  },
  templates: {
    customized: 'กำหนด เอง',
  },
  operations: {
    choose: 'เลือก',
    convert: 'แปลง',
    preview: 'ดูตัวอย่าง',
    details: 'ราย ละเอียด',
    editInfo: 'แก้ไขข้อมูล',
    process: 'แปรรูป',
    exportPipeline: 'ส่งออกไปป์ไลน์',
    saveAndProcess: 'บันทึกและประมวลผล',
    dataSource: 'แหล่งข้อมูล',
    backToDataSource: 'กลับไปที่แหล่งข้อมูล',
    useTemplate: 'ใช้ไปป์ไลน์ความรู้นี้',
  },
  deletePipeline: {
    content: 'การลบเทมเพลตไปป์ไลน์ไม่สามารถย้อนกลับได้',
    title: 'คุณแน่ใจที่จะลบเทมเพลตไปป์ไลน์นี้หรือไม่',
  },
  publishPipeline: {
    success: {
      message: 'เผยแพร่ไปป์ไลน์ความรู้',
    },
    error: {
      message: 'ไม่สามารถเผยแพร่ไปป์ไลน์ความรู้',
    },
  },
  publishTemplate: {
    success: {
      learnMore: 'ศึกษาเพิ่มเติม',
      message: 'เผยแพร่เทมเพลตไปป์ไลน์',
      tip: 'คุณสามารถใช้เทมเพลตนี้ในหน้าการสร้าง',
    },
    error: {
      message: 'ไม่สามารถเผยแพร่เทมเพลตไปป์ไลน์ได้',
    },
  },
  exportDSL: {
    successTip: 'ส่งออก DSL ไปป์ไลน์สําเร็จ',
    errorTip: 'ไม่สามารถส่งออก DSL ไปป์ไลน์ได้',
  },
  details: {
    structure: 'โครงสร้าง',
    structureTooltip: 'โครงสร้างก้อนกําหนดวิธีการแยกและจัดทําดัชนีเอกสาร โดยเสนอโหมดทั่วไป ผู้ปกครอง-รอง และ Q&A และไม่ซ้ํากันสําหรับแต่ละฐานความรู้',
  },
  testRun: {
    steps: {
      dataSource: 'แหล่งข้อมูล',
      documentProcessing: 'การประมวลผลเอกสาร',
    },
    dataSource: {
      localFiles: 'ไฟล์ในเครื่อง',
    },
    notion: {
      docTitle: 'เอกสาร Notion',
      title: 'เลือกหน้า Notion',
    },
    title: 'ทดสอบการทํางาน',
    tooltip: 'ในโหมดทดสอบการทํางาน อนุญาตให้นําเข้าเอกสารได้ครั้งละหนึ่งฉบับเท่านั้นเพื่อการดีบักและสังเกตการณ์ที่ง่ายขึ้น',
  },
  inputFieldPanel: {
    uniqueInputs: {
      title: 'อินพุตที่ไม่ซ้ํากันสําหรับแต่ละทางเข้า',
      tooltip: 'อินพุตที่ไม่ซ้ํากันสามารถเข้าถึงได้เฉพาะแหล่งข้อมูลที่เลือกและโหนดดาวน์สตรีมเท่านั้น ผู้ใช้ไม่จําเป็นต้องกรอกข้อมูลเมื่อเลือกแหล่งข้อมูลอื่น เฉพาะฟิลด์อินพุตที่อ้างอิงโดยตัวแปรแหล่งข้อมูลเท่านั้นที่จะปรากฏในขั้นตอนแรก (แหล่งข้อมูล) ฟิลด์อื่น ๆ ทั้งหมดจะแสดงในขั้นตอนที่สอง (เอกสารการประมวลผล)',
    },
    globalInputs: {
      title: 'อินพุตทั่วโลกสําหรับทางเข้าทั้งหมด',
      tooltip: 'อินพุตส่วนกลางจะถูกแชร์ในทุกโหนด ผู้ใช้จะต้องกรอกข้อมูลเมื่อเลือกแหล่งข้อมูลใดๆ ตัวอย่างเช่น ฟิลด์ เช่น ตัวคั่นและความยาวของก้อนสูงสุดสามารถนําไปใช้อย่างสม่ําเสมอกับแหล่งข้อมูลหลายแหล่ง เฉพาะฟิลด์อินพุตที่อ้างอิงโดยตัวแปรแหล่งข้อมูลเท่านั้นที่ปรากฏในขั้นตอนแรก (แหล่งข้อมูล) ฟิลด์อื่นๆ ทั้งหมดจะแสดงในขั้นตอนที่สอง (เอกสารกระบวนการ)',
    },
    preview: {
      stepOneTitle: 'แหล่งข้อมูล',
      stepTwoTitle: 'เอกสารกระบวนการ',
    },
    error: {
      variableDuplicate: 'ชื่อตัวแปรมีอยู่แล้ว โปรดเลือกชื่ออื่น',
    },
    addInputField: 'เพิ่มฟิลด์อินพุต',
    editInputField: 'แก้ไขฟิลด์อินพุต',
    title: 'ช่องป้อนข้อมูลของผู้ใช้',
    description: 'ฟิลด์การป้อนข้อมูลของผู้ใช้ใช้เพื่อกําหนดและรวบรวมตัวแปรที่จําเป็นในระหว่างกระบวนการดําเนินการไปป์ไลน์ ผู้ใช้สามารถปรับแต่งประเภทฟิลด์และกําหนดค่าอินพุตได้อย่างยืดหยุ่นเพื่อตอบสนองความต้องการของแหล่งข้อมูลหรือขั้นตอนการประมวลผลเอกสารต่างๆ',
  },
  addDocuments: {
    steps: {
      processDocuments: 'เอกสารกระบวนการ',
      processingDocuments: 'การประมวลผลเอกสาร',
      chooseDatasource: 'เลือกแหล่งข้อมูล',
    },
    stepOne: {
      preview: 'ดูตัวอย่าง',
    },
    stepTwo: {
      previewChunks: 'ดูตัวอย่างก้อน',
      chunkSettings: 'การตั้งค่าก้อน',
    },
    stepThree: {
      learnMore: 'ศึกษาเพิ่มเติม',
    },
    characters: 'อักขระ',
    backToDataSource: 'แหล่งข้อมูล',
    title: 'เพิ่มเอกสาร',
  },
  documentSettings: {
    title: 'การตั้งค่าเอกสาร',
  },
  onlineDocument: {},
  onlineDrive: {
    breadcrumbs: {
      searchPlaceholder: 'ค้นหาไฟล์...',
      allFiles: 'ไฟล์ทั้งหมด',
      allBuckets: 'ที่เก็บข้อมูลบนคลาวด์ทั้งหมด',
    },
    resetKeywords: 'รีเซ็ตคีย์เวิร์ด',
    emptySearchResult: 'ไม่พบสิ่งของ',
    notSupportedFileType: 'ไม่รองรับชนิดแฟ้มนี้',
    emptyFolder: 'โฟลเดอร์นี้ว่างเปล่า',
  },
  credentialSelector: {},
  conversion: {
    confirm: {
      title: 'การยืนยัน',
      content: 'การกระทํานี้เป็นแบบถาวร คุณจะไม่สามารถเปลี่ยนกลับไปใช้วิธีการก่อนหน้านี้ได้ โปรดยืนยันการแปลง',
    },
    title: 'แปลงเป็นไปป์ไลน์ความรู้',
    warning: 'การดําเนินการนี้ไม่สามารถยกเลิกได้',
    errorMessage: 'ไม่สามารถแปลงชุดข้อมูลเป็นไปป์ไลน์ได้',
    successMessage: 'แปลงชุดข้อมูลเป็นไปป์ไลน์เรียบร้อยแล้ว',
    descriptionChunk2: '— แนวทางที่เปิดกว้างและยืดหยุ่นมากขึ้นด้วยการเข้าถึงปลั๊กอินจากตลาดของเรา การดําเนินการนี้จะใช้วิธีการประมวลผลใหม่กับเอกสารในอนาคตทั้งหมด',
    descriptionChunk1: 'ตอนนี้คุณสามารถแปลงฐานความรู้ที่มีอยู่เพื่อใช้ไปป์ไลน์ความรู้สําหรับการประมวลผลเอกสารได้แล้ว',
  },
  knowledgePermissions: 'สิทธิ์',
  inputField: 'ฟิลด์อินพุต',
  knowledgeNameAndIcon: 'ชื่อความรู้และไอคอน',
  knowledgeDescription: 'คําอธิบายความรู้',
  knowledgeNameAndIconPlaceholder: 'โปรดป้อนชื่อฐานความรู้',
  editPipelineInfo: 'แก้ไขข้อมูลไปป์ไลน์',
  pipelineNameAndIcon: 'ชื่อและไอคอนไปป์ไลน์',
  knowledgeDescriptionPlaceholder: 'อธิบายสิ่งที่อยู่ในฐานความรู้นี้ คําอธิบายโดยละเอียดช่วยให้ AI สามารถเข้าถึงเนื้อหาของชุดข้อมูลได้แม่นยํายิ่งขึ้น หากว่างเปล่า Dify จะใช้กลยุทธ์การโจมตีเริ่มต้น (ไม่บังคับ)',
}

export default translation
