const translation = {
  common: {
    publishAsPipeline: {
      description: 'คําอธิบายความรู้',
      name: 'ชื่อและไอคอนไปป์ไลน์',
      namePlaceholder: 'โปรดป้อนชื่อของไปป์ไลน์ความรู้นี้ (จําเป็น)',
      descriptionPlaceholder: 'โปรดป้อนคําอธิบายของไปป์ไลน์ความรู้นี้ (ไม่บังคับ)',
    },
    reRun: 'เรียกใช้ซ้ํา',
    confirmPublish: 'ยืนยันการเผยแพร่',
    goToAddDocuments: 'ไปที่เพิ่มเอกสาร',
    processing: 'ประมวล ผล',
    testRun: 'ทดสอบการทํางาน',
    preparingDataSource: 'การเตรียมแหล่งข้อมูล',
    publishAs: 'เผยแพร่เป็นไปป์ไลน์ความรู้',
    confirmPublishContent: 'หลังจากเผยแพร่ไปป์ไลน์ความรู้สําเร็จแล้ว จะไม่สามารถแก้ไขโครงสร้างกลุ่มของฐานความรู้นี้ได้ คุณแน่ใจหรือไม่ว่าต้องการเผยแพร่?',
  },
  inputField: {
    manage: 'จัดการ',
    create: 'สร้างฟิลด์ป้อนข้อมูลของผู้ใช้',
  },
  publishToast: {
    title: 'ไปป์ไลน์นี้ยังไม่ได้รับการเผยแพร่',
    desc: 'เมื่อไม่ได้เผยแพร่ไปป์ไลน์ คุณสามารถปรับเปลี่ยนโครงสร้างก้อนในโหนดฐานความรู้ และการประสานไปป์ไลน์และการเปลี่ยนแปลงจะถูกบันทึกเป็นแบบร่างโดยอัตโนมัติ',
  },
  result: {
    resultPreview: {
      viewDetails: 'ดูรายละเอียด',
      error: 'เกิดข้อผิดพลาดระหว่างการดําเนินการ',
      loading: 'กำลังประมวลผล...กรุณารอ',
    },
  },
  ragToolSuggestions: {
    title: 'คําแนะนําสําหรับ RAG',
  },
}

export default translation
