{
  "currentSigned": "HIỆN ĐANG ĐĂNG NHẬP VÀO",
  "emailLabel": "Email hiện tại của bạn",
  "form.schoolName.placeholder": "Nhập tên chính thức, không viết tắt của trường bạn",
  "form.schoolName.title": "Tên Trường Của Bạn",
  "form.schoolRole.option.administrator": "Quản trị viên trường học",
  "form.schoolRole.option.student": "Học sinh",
  "form.schoolRole.option.teacher": "Giáo viên",
  "form.schoolRole.title": "Vai trò của bạn ở trường",
  "form.terms.desc.and": "và",
  "form.terms.desc.end": "Bằng cách gửi:",
  "form.terms.desc.front": "Thông tin của bạn và việc sử dụng trạng thái Được xác minh Giáo dục của chúng tôi thuộc về điều kiện của chúng tôi",
  "form.terms.desc.privacyPolicy": "Chính sách bảo mật",
  "form.terms.desc.termsOfService": "Điều khoản dịch vụ",
  "form.terms.option.age": "Tôi xác nhận rằng tôi ít nhất 18 tuổi",
  "form.terms.option.inSchool": "Tôi xác nhận rằng tôi đã đăng ký hoặc làm việc tại cơ sở đã cung cấp. Dify có thể yêu cầu chứng minh về việc đăng ký/làm việc. Nếu tôi cung cấp thông tin không chính xác về đủ điều kiện của mình, tôi đồng ý trả bất kỳ khoản phí nào ban đầu được miễn dựa trên tình trạng giáo dục của tôi.",
  "form.terms.title": "Điều khoản & Thỏa thuận",
  "learn": "Học cách xác minh trình độ giáo dục",
  "notice.action.dismiss": "Bỏ qua",
  "notice.action.reVerify": "Xác minh lại",
  "notice.action.upgrade": "Nâng cấp",
  "notice.alreadyGraduated.expired": "Hãy thoải mái nâng cấp bất kỳ lúc nào để có quyền truy cập đầy đủ vào các tính năng trả phí.",
  "notice.alreadyGraduated.isAboutToExpire": "Gói đăng ký hiện tại của bạn vẫn sẽ hoạt động. Khi nó kết thúc, bạn sẽ được chuyển sang gói Sandbox, hoặc bạn có thể nâng cấp bất cứ lúc nào để khôi phục quyền truy cập đầy đủ vào các tính năng trả phí.",
  "notice.alreadyGraduated.title": "Đã tốt nghiệp rồi sao?",
  "notice.dateFormat": "MM/DD/YYYY",
  "notice.expired.summary.line1": "Bạn vẫn có thể truy cập và sử dụng Dify.",
  "notice.expired.summary.line2": "Tuy nhiên, bạn không còn đủ điều kiện để nhận phiếu giảm giá giáo dục mới.",
  "notice.expired.title": "Tình trạng giáo dục của bạn đã hết hạn",
  "notice.isAboutToExpire.summary": "Đừng lo — điều này sẽ không ảnh hưởng đến gói đăng ký hiện tại của bạn, nhưng bạn sẽ không nhận được giảm giá giáo dục khi nó tự động gia hạn trừ khi bạn xác minh lại trạng thái của mình.",
  "notice.isAboutToExpire.title": "Tình trạng giáo dục của bạn sẽ hết hạn vào {{date}}",
  "notice.stillInEducation.expired": "Xác minh lại ngay bây giờ để nhận một phiếu giảm giá mới cho năm học sắp tới. Chúng tôi sẽ thêm nó vào tài khoản của bạn và bạn có thể sử dụng nó cho lần nâng cấp tiếp theo.",
  "notice.stillInEducation.isAboutToExpire": "Xác minh lại ngay bây giờ để nhận một phiếu giảm giá mới cho năm học sắp tới. Nó sẽ được lưu vào tài khoản của bạn và sẵn sàng sử dụng khi bạn gia hạn tiếp theo.",
  "notice.stillInEducation.title": "Vẫn đang học tập?",
  "rejectContent": "Rất tiếc, bạn không đủ điều kiện để nhận trạng thái Xác minh Giáo dục và do đó không thể nhận được mã giảm giá độc quyền 100% cho Kế hoạch Chuyên nghiệp Dify nếu bạn sử dụng địa chỉ email này.",
  "rejectTitle": "Yêu cầu xác minh giáo dục Dify của bạn đã bị từ chối",
  "submit": "Gửi",
  "submitError": "Gửi mẫu không thành công. Vui lòng thử lại sau.",
  "successContent": "Chúng tôi đã phát hành một phiếu giảm giá 100% cho gói Dify Professional vào tài khoản của bạn. Phiếu giảm giá có hiệu lực trong một năm, vui lòng sử dụng nó trong thời gian hiệu lực.",
  "successTitle": "Bạn đã được xác minh giáo dục Dify",
  "toVerified": "Xác thực giáo dục",
  "toVerifiedTip.coupon": "mã giảm giá độc quyền 100%",
  "toVerifiedTip.end": "cho Kế hoạch Chuyên nghiệp Dify.",
  "toVerifiedTip.front": "Bạn hiện đủ điều kiện để có trạng thái Xác minh Giáo dục. Vui lòng nhập thông tin giáo dục của bạn bên dưới để hoàn tất quá trình và nhận một"
}
